var a = [
  {
      "key": "yellowKey",
      "name": "元宝",
      "text": "元宝可以购买或者兑换特殊物品",
      "count": 1000000000
  },
  {
      "key": "blueKey",
      "name": "金刚石",
      "text": "类似元宝，但只有BOSS才出的金刚石（沃玛教主 触龙神 石墓尸王 祖玛教主 赤月恶魔等）",
      "count": 1000000000
  },
  // {
  //     "key": "redKey",
  //     "name": "杀戮值",
  //     "text": "满3点就要进红名村监狱"
  // },
  {
      "key": "yellowPotion",
      "name": "Z狂雷头盔",
      "text": "需要等级55，防御10-15，魔御5-10，攻击5-10"
  },
  {
      "key": "sword0",
      "name": "【全】中型盔甲女",
      "text": "需要等级16，防御3-5，魔御1-2"
  },
  {
      "key": "sword1",
      "name": "F逆火魔衣5",
      "text": "需要等级55，防御15-35，魔御15-30，魔法5-15"
  },
  {
      "key": "sword2",
      "name": "D通云道袍",
      "text": "需要等级55，防御15-25，魔御15-20，道术5-10"
  },
  // {
  //     "key": "sword3",
  //     "name": "战士内挂",
  //     "text": "可以查看各种攻略及战士特有功能(快捷键V)"
  // },
  // {
  //     "key": "sword4",
  //     "name": "道士内挂",
  //     "text": "可以查看各种攻略及道士特有功能(快捷键V)"
  // },
  {
      "key": "sword5",
      "name": "【全】青铜头盔",
      "text": "需要等级10，防御0-1"
  },
  {
      "key": "shield1",
      "name": "【全】魔法头盔",
      "text": "需要等级14，防御0-1，魔御1-1"
  },
  {
      "key": "shield2",
      "name": "【全】道士头盔",
      "text": "需要等级24，防御1-3，魔御2-3"
  },
  {
      "key": "shield3",
      "name": "乌木剑丶法师",
      "text": "魔法0-4"
  },
  {
      "key": "shield4",
      "name": "【全】布衣女",
      "text": "防御0-2"
  },
  {
      "key": "shield5",
      "name": "【全】轻型盔甲女",
      "text": "需要等级11，防御3-3，魔御1-2"
  },
  {
      "key": "superPotion",
      "name": "F逆火头盔",
      "text": "需要等级55，防御10-15，魔御5-10，魔法5-9"
  },
  {
      "key": "silverCoin",
      "name": "【全】金戒指",
      "text": "需要等级22，魔御0-3，攻击0-2，魔法0-2，道术0-2"
  },
  {
      "key": "fly",
      "name": "传送戒指",
      "text": "传奇特殊戒指，可以让你传送至任意地图（特殊地图无法使用）"
  },
  {
      "key": "freezeBadge",
      "name": "D通云头盔5",
      "text": "需要等级55，防御10-15，魔御5-10，道术5-20"
  },
  {
      "key": "cross",
      "name": "D通云头盔4",
      "text": "需要等级55，防御10-15，魔御5-10，道术5-18"
  },
  {
      "key": "dagger",
      "name": "【全】金项链",
      "text": "需要等级2，攻击0-1"
  },
  {
      "key": "amulet",
      "name": "【全】降妖除魔戒指",
      "text": "需要等级25，魔御0-4，攻击1-2，魔法1-2，道术1-2"
  },
  {
      "key": "greenKey",
      "name": "红包",
      "text": "双击使用，可以兑换刀刀切割和终极装备（如何获取请到土城刀刀切割处查看说明）",
      "count": 1000000000
  },
  {
      "key": "pickaxe",
      "name": "【全】古铜戒指",
      "text": "需要等级3，攻击0-1"
  },
  {
      "key": "icePickaxe",
      "name": "【全】铁手镯",
      "text": "需要等级3，魔御0-2"
  },
  {
      "key": "bomb",
      "name": "【全】传统项链",
      "text": "需要等级3，魔御0-2"
  },
  {
      "key": "poisonWine",
      "name": "Z狂雷头盔1",
      "text": "需要等级55，防御10-15，魔御5-10，攻击5-12"
  },
  {
      "key": "weakWine",
      "name": "Z狂雷头盔2",
      "text": "需要等级55，防御10-15，魔御5-10，攻击5-14"
  },
  {
      "key": "curseWine",
      "name": "Z狂雷头盔4",
      "text": "需要等级55，防御10-15，魔御5-10，攻击5-18"
  },
  {
      "key": "superWine",
      "name": "Z狂雷头盔5",
      "text": "需要等级55，防御10-15，魔御5-10，攻击5-20"
  },
  {
      "key": "hammer",
      "name": "F逆火魔衣3",
      "text": "需要等级55，防御15-31，魔御15-26，魔法5-13"
  },
  {
      "key": "lifeWand",
      "name": "F逆火头盔4",
      "text": "需要等级55，防御10-15，魔御5-10，魔法5-13"
  },
  {
      "key": "jumpShoes",
      "name": "F逆火魔衣4",
      "text": "需要等级55，防御15-33，魔御15-28，魔法5-14"
  },
  // {
  //     "key": "skill1",
  //     "name": "技能：二倍斩",
  //     "text": "可以打开或关闭主动技能二倍斩"
  // },
  {
      "key": "I342",
      "name": "Z狂雷头盔3",
      "text": "需要等级55，防御10-15，魔御5-10，攻击5-16"
  },
  {
      "key": "I343",
      "name": "F逆火头盔2",
      "text": "需要等级55，防御10-15，魔御5-10，魔法5-11"
  },
  {
      "key": "I344",
      "name": "F逆火头盔3",
      "text": "需要等级55，防御10-15，魔御5-10，魔法5-12"
  },
  // {
  //     "key": "I345",
  //     "name": "法师内挂",
  //     "text": "可以查看各种攻略及法师特有功能(快捷键V)"
  // },
  {
      "key": "I346",
      "name": "F逆火头盔5",
      "text": "需要等级55，防御10-15，魔御5-10，魔法5-14"
  },
  {
      "key": "I347",
      "name": "D通云头盔",
      "text": "需要等级55，防御10-15，魔御5-10，道术5-10"
  },
  {
      "key": "I348",
      "name": "D通云头盔1",
      "text": "需要等级55，防御10-15，魔御5-10，道术5-12"
  },
  {
      "key": "I349",
      "name": "D通云头盔2",
      "text": "需要等级55，防御10-15，魔御5-10，道术5-14"
  },
  {
      "key": "I350",
      "name": "D通云头盔3",
      "text": "需要等级55，防御10-15，魔御5-10，道术5-16"
  },
  {
      "key": "I351",
      "name": "【全】木剑",
      "text": "攻击0-3，魔法0-1，道术0-1"
  },
  {
      "key": "I352",
      "name": "Z乌木剑",
      "text": "攻击2-4"
  },
  {
      "key": "I353",
      "name": "Z铁剑",
      "text": "需要等级10，攻击2-6"
  },
  {
      "key": "I354",
      "name": "Z短剑",
      "text": "需要等级10，攻击3-7"
  },
  {
      "key": "I355",
      "name": "Z青铜斧",
      "text": "需要等级13，攻击0-15"
  },
  {
      "key": "I356",
      "name": "Z八荒",
      "text": "需要等级15，攻击4-8"
  },
  {
      "key": "I357",
      "name": "Z斩马刀",
      "text": "需要等级20，攻击3-15"
  },
  {
      "key": "I358",
      "name": "Z修罗",
      "text": "需要等级22，攻击0-20"
  },
  {
      "key": "I359",
      "name": "Z炼狱",
      "text": "需要等级26，攻击0-25"
  },
  {
      "key": "I360",
      "name": "Z裁决",
      "text": "需要等级30，攻击0-30"
  },
  {
      "key": "I361",
      "name": "D通云道袍1",
      "text": "需要等级55，防御15-25，魔御15-20，道术5-10"
  },
  {
      "key": "I362",
      "name": "【全】布衣男",
      "text": "防御0-2"
  },
  {
      "key": "I363",
      "name": "【全】轻型盔甲男",
      "text": "需要等级11，防御3-3，魔御1-2"
  },
  {
      "key": "I364",
      "name": "【全】中型盔甲男",
      "text": "需要等级16，防御3-5，魔御1-2"
  },
  {
      "key": "I365",
      "name": "Z重盔甲",
      "text": "需要等级22，防御4-7，魔御2-3"
  },
  {
      "key": "I366",
      "name": "Z战神盔甲",
      "text": "需要攻击力48，防御5-9，魔御3-5"
  },
  {
      "key": "I367",
      "name": "D通云道袍2",
      "text": "需要等级55，防御15-29，魔御15-24，道术5-14"
  },
  {
      "key": "I368",
      "name": "【全】金项链2",
      "text": "需要等级2，攻击0-1"
  },
  {
      "key": "I369",
      "name": "【全】传统项链2",
      "text": "需要等级3，魔御0-2"
  },
  {
      "key": "I370",
      "name": "Z魔鬼项链",
      "text": "需要等级17，攻击0-2"
  },
  {
      "key": "I371",
      "name": "Z蓝翡翠项链",
      "text": "需要等级23，攻击2-2"
  },
  {
      "key": "I372",
      "name": "Z幽灵项链",
      "text": "需要等级24，攻击0-5"
  },
  {
      "key": "I373",
      "name": "Z绿色项链",
      "text": "需要攻击力45，攻击2-5"
  },
  {
      "key": "I374",
      "name": "D通云道袍3",
      "text": "需要等级55，防御15-31，魔御15-26，道术5-16"
  },
  {
      "key": "I375",
      "name": "【全】铁手镯2",
      "text": "需要等级3，魔御0-2"
  },
  {
      "key": "I376",
      "name": "Z大手镯",
      "text": "需要等级9，防御0-1"
  },
  {
      "key": "I377",
      "name": "Z魔力手镯",
      "text": "需要等级20，攻击0-2"
  },
  {
      "key": "I378",
      "name": "Z金手镯",
      "text": "需要等级23，魔御2-3，攻击0-1"
  },
  {
      "key": "I379",
      "name": "Z死神手镯",
      "text": "需要等级22，攻击1-2"
  },
  {
      "key": "I380",
      "name": "Z阎罗手套",
      "text": "需要等级30，防御0-3"
  },
  {
      "key": "I381",
      "name": "Z骑士手镯",
      "text": "需要攻击力45，攻击2-2"
  },
  {
      "key": "I382",
      "name": "D通云道袍4",
      "text": "需要等级55，防御15-31，魔御15-26，道术5-16"
  },
  {
      "key": "I383",
      "name": "【全】古铜戒指2",
      "text": "需要等级3，攻击0-1"
  },
  {
      "key": "I384",
      "name": "Z蓝色水晶戒指",
      "text": "需要等级16，魔御0-2，攻击0-1"
  },
  {
      "key": "I385",
      "name": "Z黑色水晶戒指",
      "text": "需要等级20，攻击0-2"
  },
  {
      "key": "I386",
      "name": "金戒指丶全职业",
      "text": "需要等级22，魔御0-3，攻击0-2，魔法0-2，道术0-2"
  },
  {
      "key": "I387",
      "name": "降妖除魔戒指丶全职业",
      "text": "需要等级25，魔御0-4，攻击1-2，魔法1-2，道术1-2"
  },
  {
      "key": "I388",
      "name": "Z骷髅戒指",
      "text": "需要攻击力30，攻击0-3"
  },
  {
      "key": "I389",
      "name": "Z珊瑚戒指",
      "text": "需要等级25，攻击0-4"
  },
  {
      "key": "I390",
      "name": "Z龙之戒指",
      "text": "需要攻击力37，攻击0-5"
  },
  {
      "key": "I391",
      "name": "Z力量戒指",
      "text": "需要攻击力50，攻击0-6"
  },
  {
      "key": "I392",
      "name": "D通云道袍5",
      "text": "需要等级55，防御15-35，魔御15-30，道术5-20"
  },
  {
      "key": "I393",
      "name": "【全】青铜头盔2",
      "text": "需要等级10，防御0-1"
  },
  {
      "key": "I394",
      "name": "【全】魔法头盔2",
      "text": "需要等级14，防御0-1，魔御1-1"
  },
  {
      "key": "I395",
      "name": "【全】道士头盔2",
      "text": "需要等级24，防御1-3，魔御2-3"
  },
  {
      "key": "I396",
      "name": "Z记忆头盔",
      "text": "需要等级26，防御3-3"
  },
  {
      "key": "I397",
      "name": "Z骷髅头盔",
      "text": "需要攻击力30，防御3-3，魔御2-4"
  },
  {
      "key": "I398",
      "name": "Z黑铁头盔",
      "text": "需要攻击力50，防御4-5，魔御2-3"
  },
  {
      "key": "I399",
      "name": "万年雪霜",
      "text": "加2000点生命和魔力(快捷键“大小键盘数字0”)",
      "count": 99999
  },
  {
      "key": "I400",
      "name": "金创药小瓶",
      "text": "快捷键1，增加60点生命（可在内挂里设置）",
      "count": 99999
  },
  {
      "key": "I401",
      "name": "金创药中瓶",
      "text": "快捷键1，增加140点生命（可在内挂里设置）",
      "count": 99999
  },
  {
      "key": "I402",
      "name": "金创药大瓶",
      "text": "快捷键1，增加320点生命（可在内挂里设置）",
      "count": 99999
  },
  {
      "key": "I403",
      "name": "回城卷",
      "count": 99999
  },
  {
      "key": "I452",
      "name": "金币",
      "count": 999999999
  },
  {
      "key": "I453",
      "name": "盟重回城石",
      "count": 99999
  },
  {
      "key": "I454",
      "name": "比奇大城回城石",
      "count": 99999
  },
  {
      "key": "I455",
      "name": "新手村回城石",
      "count": 99999
  },
  {
      "key": "I456",
      "name": "F赤血魔剑",
      "text": "需要等级35，魔法3-10(比原版要加强一点)"
  },
  {
      "key": "I457",
      "name": "Z赤血魔剑",
      "text": "需要等级35，攻击15-28(比原版要加强一点)"
  },
  {
      "key": "I458",
      "name": "Z屠龙刀",
      "text": "需要等级34，攻击7-35"
  },
  {
      "key": "I459",
      "name": "Z怒斩",
      "text": "需要攻击力50，攻击12-26"
  },
  {
      "key": "I460",
      "name": "Z天魔神甲",
      "text": "需要等级40，防御5-12，魔御4-7，攻击1-2"
  },
  {
      "key": "I461",
      "name": "Z圣战头盔",
      "text": "需要攻击力54，防御4-5，魔御2-3，攻击0-1"
  },
  {
      "key": "I462",
      "name": "Z圣战手镯",
      "text": "需要攻击力54，防御0-1，攻击2-3"
  },
  {
      "key": "I463",
      "name": "Z圣战项链",
      "text": "需要攻击力54，攻击3-6"
  },
  {
      "key": "I464",
      "name": "Z圣战戒指",
      "text": "需要攻击力54，魔御0-1，攻击0-7"
  },
  {
      "key": "I465",
      "name": "罗刹",
      "text": "任务道具,积累到一定数量后可以兑换赤血魔剑",
      "count": 99999
  },
  // {
  //     "key": "I466",
  //     "name": "远程攻击",
  //     "text": "快捷键6或者空格键，可以远程攻击,使用后请点击要攻击的对象，但不能穿墙。(隐身时不能使用)"
  // },
  {
      "key": "I467",
      "name": "随机传送石",
      "count": 99999
  },
  {
      "key": "I468",
      "name": "肉",
      "text": "使用可以增加100金币,红名村有特殊用途",
      "count": 99999
  },
  {
      "key": "I469",
      "name": "幻境经验",
      "text": "只要在幻境地图有1.5倍经验"
  },
  // {
  //     "key": "I471",
  //     "name": "信物",
  //     "text": "带上信物回城交给负责人吧"
  // },
  {
      "key": "I474",
      "name": "Z青铜斧1",
      "text": "需要等级13，攻击0-16(极品+1)"
  },
  {
      "key": "I475",
      "name": "Z炼狱1",
      "text": "需要等级26，攻击0-26(极品+1)"
  },
  {
      "key": "I476",
      "name": "Z炼狱2",
      "text": "需要等级26，攻击0-27(极品+2)"
  },
  {
      "key": "I477",
      "name": "Z裁决1",
      "text": "需要等级30，攻击0-31(极品+1)"
  },
  {
      "key": "I478",
      "name": "Z裁决2",
      "text": "需要等级30，攻击0-32(极品+2)"
  },
  {
      "key": "I479",
      "name": "Z重盔甲男攻击1",
      "text": "需要等级22，防御4-7，魔御2-3，攻击0-1(极品攻击+1)"
  },
  {
      "key": "I480",
      "name": "Z重盔甲男攻击2",
      "text": "需要等级22，防御4-7，魔御2-3，攻击0-2(极品攻击+2)"
  },
  {
      "key": "I481",
      "name": "Z重盔甲男防御1",
      "text": "需要等级22，防御4-8，魔御2-4(极品防御+1)"
  },
  {
      "key": "I482",
      "name": "Z重盔甲男防御2",
      "text": "需要等级22，防御4-9，魔御2-5(极品防御+2)"
  },
  {
      "key": "I483",
      "name": "Z战神盔甲男攻击1",
      "text": "需要攻击力48，防御5-9，魔御3-5，攻击0-1(极品攻击+1)"
  },
  {
      "key": "I484",
      "name": "Z战神盔甲男攻击2",
      "text": "需要攻击力48，防御5-9，魔御3-5，攻击0-2(极品攻击+2)"
  },
  {
      "key": "I485",
      "name": "Z战神盔甲男防御1",
      "text": "需要攻击力48，防御5-10，魔御3-6(极品防御+1)"
  },
  {
      "key": "I486",
      "name": "Z战神盔甲男防御2",
      "text": "需要攻击力48，防御5-11，魔御3-7(极品防御+2)"
  },
  {
      "key": "I487",
      "name": "Z蓝翡翠项链1",
      "text": "需要等级23，攻击2-2，防御0-1(极品防御+1)"
  },
  {
      "key": "I488",
      "name": "Z蓝翡翠项链2",
      "text": "需要等级23，攻击2-3，防御0-1(极品全属性+1)"
  },
  {
      "key": "I489",
      "name": "Z幽灵项链1",
      "text": "需要等级24，攻击0-6(极品攻击+1)"
  },
  {
      "key": "I490",
      "name": "Z幽灵项链2",
      "text": "需要等级24，攻击0-7(极品攻击+1)"
  },
  {
      "key": "I491",
      "name": "Z绿色项链1",
      "text": "需要攻击力45，攻击2-6(极品攻击+1)"
  },
  {
      "key": "I492",
      "name": "Z绿色项链2",
      "text": "需要攻击力45，攻击2-7(极品攻击+2)"
  },
  {
      "key": "I493",
      "name": "Z死神手镯1",
      "text": "需要等级22，攻击1-3(极品攻击+1)"
  },
  {
      "key": "I494",
      "name": "Z死神手镯2",
      "text": "需要等级22，攻击1-4(极品攻击+2)"
  },
  {
      "key": "I495",
      "name": "Z阎罗手套1",
      "text": "需要等级25，防御0-4(极品防御+1)"
  },
  {
      "key": "I496",
      "name": "Z阎罗手套2",
      "text": "需要等级25，防御0-4，攻击0-1(极品防御+1,攻击+1)"
  },
  {
      "key": "I497",
      "name": "Z骑士手镯1",
      "text": "需要攻击力45，攻击2-3(极品攻击+1)"
  },
  {
      "key": "I498",
      "name": "Z骑士手镯2",
      "text": "需要攻击力45，攻击2-4(极品攻击+2)"
  },
  {
      "key": "I499",
      "name": "Z珊瑚戒指1",
      "text": "需要等级25，攻击0-5(极品攻击+1)"
  },
  {
      "key": "I500",
      "name": "Z珊瑚戒指2",
      "text": "需要等级25，攻击0-6(极品攻击+2)"
  },
  {
      "key": "I501",
      "name": "Z龙之戒指1",
      "text": "需要攻击力37，攻击0-6(极品攻击+1)"
  },
  {
      "key": "I502",
      "name": "Z龙之戒指2",
      "text": "需要攻击力37，攻击0-7(极品攻击+2)"
  },
  {
      "key": "I503",
      "name": "Z力量戒指1",
      "text": "需要攻击力50，攻击0-7(极品攻击+1)"
  },
  {
      "key": "I504",
      "name": "Z力量戒指2",
      "text": "需要攻击力50，攻击0-8(极品攻击+2)"
  },
  {
      "key": "I505",
      "name": "Z记忆头盔1",
      "text": "需要等级26，防御3-4(极品防御+1)"
  },
  {
      "key": "I506",
      "name": "Z记忆头盔2",
      "text": "需要等级26，防御3-5(极品防御+2)"
  },
  {
      "key": "I507",
      "name": "Z骷髅头盔1",
      "text": "需要攻击力30，防御3-4，魔御2-5(极品防御+1)"
  },
  {
      "key": "I508",
      "name": "Z骷髅头盔2",
      "text": "需要攻击力30，防御3-5，魔御2-6(极品防御+2)"
  },
  {
      "key": "I509",
      "name": "Z黑铁头盔1",
      "text": "需要攻击力50，防御4-6，魔御2-4(极品防御+1)"
  },
  {
      "key": "I510",
      "name": "Z黑铁头盔2",
      "text": "需要攻击力50，防御4-7，魔御2-5(极品防御+2)"
  },
  {
      "key": "I511",
      "name": "D通云道衣",
      "text": "需要等级55，防御15-25，魔御15-20，道术5-10"
  },
  {
      "key": "I512",
      "name": "Z双七屠龙刀",
      "text": "需要等级45,攻击+7,真正的超级武器"
  },
  {
      "key": "I513",
      "name": "D通云道衣1",
      "text": "需要等级55，防御15-25，魔御15-20，道术5-10"
  },
  {
      "key": "I514",
      "name": "Z屠龙刀1",
      "text": "需要等级34，攻击7-37(极品攻击+2)"
  },
  {
      "key": "I515",
      "name": "Z屠龙刀2",
      "text": "需要等级34，攻击7-39(极品攻击+4)"
  },
  {
      "key": "I516",
      "name": "Z屠龙刀3",
      "text": "需要等级34，攻击7-42(极品攻击+7)"
  },
  {
      "key": "I517",
      "name": "Z怒斩1",
      "text": "需要攻击力50，攻击12-28(极品攻击+2)"
  },
  {
      "key": "I518",
      "name": "Z怒斩2",
      "text": "需要攻击力50，攻击12-30(极品攻击+4)"
  },
  {
      "key": "I519",
      "name": "Z怒斩3",
      "text": "需要攻击力50，攻击12-33(极品攻击+7)"
  },
  {
      "key": "I520",
      "name": "Z天魔神甲1",
      "text": "需要等级40，防御5-13，魔御4-8，攻击1-3(极品全属性+1) "
  },
  {
      "key": "I521",
      "name": "Z天魔神甲2",
      "text": "需要等级40，防御5-14，魔御4-9，攻击1-4(极品全属性+2) "
  },
  {
      "key": "I522",
      "name": "Z天魔神甲3",
      "text": "需要等级40，防御5-15，魔御4-10，攻击1-5(极品全属性+3) "
  },
  {
      "key": "I523",
      "name": "Z圣战头盔1",
      "text": "需要攻击力54，防御4-6，魔御2-4，攻击0-2(极品全属性+1)"
  },
  {
      "key": "I524",
      "name": "Z圣战头盔2",
      "text": "需要攻击力54，防御4-7，魔御2-5，攻击0-3(极品全属性+2)"
  },
  {
      "key": "I525",
      "name": "Z圣战头盔3",
      "text": "需要攻击力54，防御4-8，魔御2-6，攻击0-4(极品全属性+3)"
  },
  {
      "key": "I526",
      "name": "Z圣战手镯1",
      "text": "需要攻击力54，防御0-2，攻击2-4(极品攻防+1)"
  },
  {
      "key": "I527",
      "name": "Z圣战手镯2",
      "text": "需要攻击力54，防御0-3，攻击2-5(极品攻防+2)"
  },
  {
      "key": "I528",
      "name": "Z圣战手镯3",
      "text": "需要攻击力54，防御0-4，攻击2-6(极品攻防+3)"
  },
  {
      "key": "I529",
      "name": "Z圣战项链1",
      "text": "需要攻击力54，攻击3-7(极品攻击+1)"
  },
  {
      "key": "I530",
      "name": "Z圣战项链2",
      "text": "需要攻击力54，攻击3-8(极品攻击+2)"
  },
  {
      "key": "I531",
      "name": "Z圣战项链3",
      "text": "需要攻击力54，攻击3-9(极品攻击+3)"
  },
  {
      "key": "I532",
      "name": "Z圣战戒指1",
      "text": "需要攻击力54，魔御0-2，攻击0-8(极品攻防+1)"
  },
  {
      "key": "I533",
      "name": "Z圣战戒指2",
      "text": "需要攻击力54，魔御0-3，攻击0-9(极品攻防+2)"
  },
  {
      "key": "I534",
      "name": "Z圣战戒指3",
      "text": "需要攻击力54，魔御0-4，攻击0-10(极品攻防+2)"
  },
  {
      "key": "I536",
      "name": "随机传送劵",
      "text": "随机传送到本地图任意位置(特殊地图无法传送)如果传送到死角,要么回城要么继续传送",
      "count": 99999
  },
  {
      "key": "I586",
      "name": "打捆随机传送劵",
      "text": "使用可以获得10个随机传送劵",
      "count": 99999
  },
  {
      "key": "I587",
      "name": "金创药中瓶包",
      "text": "即可获得10瓶金创药中瓶)",
      "count": 99999
  },
  {
      "key": "I588",
      "name": "超级金创药",
      "text": "即可获得10瓶金创药大瓶)",
      "count": 99999
  },
  {
      "key": "I589",
      "name": "万年雪霜包",
      "text": "即可获得10个万年雪霜)",
      "count": 99999
  },
  {
      "key": "I591",
      "name": "魔法药小瓶",
      "text": "快捷键2，增加50点魔力值（可在内挂里设置）",
      "count": 99999
  },
  {
      "key": "I592",
      "name": "魔法药中瓶",
      "text": "快捷键2，增加150点魔力值（可在内挂里设置）",
      "count": 99999
  },
  {
      "key": "I593",
      "name": "魔法药中瓶包",
      "text": "使用即可获得10瓶魔法药中瓶)",
      "count": 99999
  },
  {
      "key": "I594",
      "name": "魔法药大瓶",
      "text": "快捷键2，增加400点魔力值（可在内挂里设置）",
      "count": 99999
  },
  {
      "key": "I595",
      "name": "超级魔法药",
      "text": "使用即可获得10瓶魔法药大瓶)",
      "count": 99999
  },
  {
      "key": "I596",
      "name": "祝福油",
      "text": "增加/减少你佩戴武器的幸运值，提高你的最低攻击，武器最高幸运+7",
      "count": 99999
  },
  // {
  //     "key": "I597",
  //     "name": "火球术",
  //     "text": "(快捷键3)法师初级魔法,可以使用魔法攻击并增强攻击力,魔力消耗40点（双击本道具可进行设置）"
  // },
  // {
  //     "key": "I598",
  //     "name": "雷电术",
  //     "text": "(快捷键3)雷电术为法师中级魔法,高伤害,魔力消耗100点"
  // },
  // {
  //     "key": "I599",
  //     "name": "魔法盾",
  //     "text": "魔法盾为魔塔版魔法,可以大幅提升10-20防御力，并且可以使用其他技能,魔力消耗200点"
  // // },
  // {
  //     "key": "I601",
  //     "name": "原地休息",
  //     "text": "快捷键5，每次大约消耗3秒，原地恢复你的生命值和魔法值。跟原版一样，是按照生命魔法上限的百分比来恢复"
  // },
  // {
  //     "key": "I602",
  //     "name": "原地休息中级",
  //     "text": "原地恢复战士获得25点血,法师10点血+35点魔力，道士17点血+17点魔力"
  // },
  // {
  //     "key": "I603",
  //     "name": "原地休息高级",
  //     "text": "原地恢复战士获得50点血,法师15点血+80点魔力，道士30点血+40点魔力"
  // },
  // {
  //     "key": "I604",
  //     "name": "瞬息移动",
  //     "text": "消耗40点魔力。可以在本地图随机飞（取消了原版地牢逃脱属性）"
  // },
  // {
  //     "key": "I605",
  //     "name": "诱惑之光",
  //     "text": "(快捷键7),消耗20点魔力，对面前的怪诱惑，有概率召唤自己宝宝（请面对面重复使用,Z键角色转向）(只对虎卫、多多、半兽勇士有效，其他怪无效)，有魔法盾时无法使用本技能"
  // },
  // {
  //     "key": "I606",
  //     "name": "爆裂火焰",
  //     "text": "(快捷键4)法师群攻技能，可以远程释放，对怪周围同样造成伤害，消耗200点魔力"
  // },
  // {
  //     "key": "I607",
  //     "name": "冰咆哮",
  //     "text": "(快捷键4)法师群攻技能，可以远程释放，对怪周围同样造成伤害，消耗400点魔力"
  // },
  {
      "key": "I608",
      "name": "F海魂",
      "text": "需要等级15，魔法1-2"
  },
  {
      "key": "I609",
      "name": "F偃月",
      "text": "需要等级20，魔法1-3"
  },
  {
      "key": "I610",
      "name": "F偃月1",
      "text": "需要等级20，魔法1-4(极品魔+1)"
  },
  {
      "key": "I611",
      "name": "F偃月2",
      "text": "需要等级20，魔法1-5(极品魔+2)"
  },
  {
      "key": "I612",
      "name": "F魔杖",
      "text": "需要等级26，魔法2-5"
  },
  {
      "key": "I613",
      "name": "F魔杖1",
      "text": "需要等级26，魔法2-6(极品魔+1)"
  },
  {
      "key": "I614",
      "name": "F魔杖2",
      "text": "魔需要等级26，法2-7(极品魔+2)"
  },
  {
      "key": "I615",
      "name": "F骨玉权杖",
      "text": "需要等级35，魔法2-6"
  },
  {
      "key": "I616",
      "name": "F骨玉权杖1",
      "text": "需要等级35，魔法2-8(极品魔+2)"
  },
  {
      "key": "I617",
      "name": "F骨玉权杖2",
      "text": "需要等级35，魔法2-10(极品魔+4)"
  },
  {
      "key": "I618",
      "name": "F龙牙",
      "text": "需要魔法力34，魔法3-6"
  },
  {
      "key": "I619",
      "name": "F龙牙1",
      "text": "需要魔法力34，魔法3-8(极品魔+2)"
  },
  {
      "key": "I620",
      "name": "F龙牙2",
      "text": "需要魔法力34，魔法3-10(极品魔+4)"
  },
  {
      "key": "I621",
      "name": "F龙牙3",
      "text": "需要魔法力34，魔法3-13(极品魔+7)"
  },
  {
      "key": "I622",
      "name": "F嗜魂法杖",
      "text": "需要等级35，魔法4-10"
  },
  {
      "key": "I623",
      "name": "F嗜魂法杖1",
      "text": "需要等级35，魔法4-12(极品魔+2)"
  },
  {
      "key": "I624",
      "name": "F嗜魂法杖2",
      "text": "需要等级35，魔法4-14(极品魔+4)"
  },
  {
      "key": "I625",
      "name": "F嗜魂法杖3",
      "text": "需要等级35，魔法4-17(极品魔+7)"
  },
  {
      "key": "I626",
      "name": "F双七嗜魂法杖",
      "text": "需要等级45，魔法+7,真正的超级武器"
  },
  {
      "key": "I627",
      "name": "单体魔法使用",
      "text": "快捷键3，可以跟原版传奇一样远程攻击怪物且不被打，但是速度较慢。"
  },
  {
      "key": "I628",
      "name": "F魔法长袍男",
      "text": "需要等级22，防御3-5，魔御3-4，魔法0-2"
  },
  {
      "key": "I629",
      "name": "F魔法长袍男1",
      "text": "需要等级22，防御3-6，魔御3-5，魔法0-3(极品魔法、防御+1)"
  },
  {
      "key": "I630",
      "name": "F魔法长袍男2",
      "text": "需要等级22，防御3-7，魔御3-6，魔法0-4(极品魔法、防御+2)"
  },
  {
      "key": "I631",
      "name": "F恶魔长袍男",
      "text": "需要魔法力28，防御4-7，魔御3-4，魔法1-4"
  },
  {
      "key": "I632",
      "name": "F恶魔长袍男1",
      "text": "需要魔法力28，防御4-8，魔御3-5，魔法1-5(极品魔法、防御+1)"
  },
  {
      "key": "I633",
      "name": "F恶魔长袍男2",
      "text": "需要魔法力28，防御4-9，魔御3-6，魔法1-6(极品魔法、防御+2)"
  },
  {
      "key": "I634",
      "name": "F法神披风",
      "text": "需要等级40，防御4-9，魔御4-6，魔法2-5"
  },
  {
      "key": "I635",
      "name": "F法神披风1",
      "text": "需要等级40，防御4-10，魔御4-7，魔法2-6(极品魔法、防御+1)"
  },
  {
      "key": "I636",
      "name": "F法神披风2",
      "text": "需要等级40，防御4-11，魔御4-8，魔法2-7(极品魔法、防御+2)"
  },
  {
      "key": "I637",
      "name": "F法神披风3",
      "text": "需要等级40，防御4-12，魔御4-9，魔法2-8(极品魔法、防御+3)"
  },
  // {
  //     "key": "I638",
  //     "name": "群体魔法使用",
  //     "text": "快捷键4，可以跟原版传奇一样远程攻击怪物且不被打，但是速度较慢。"
  // },
  {
      "key": "I639",
      "name": "【全】祈祷头盔",
      "text": "需要等级18，防御3-4，魔御1-2"
  },
  {
      "key": "I640",
      "name": "F法神头盔",
      "text": "需要魔法力32，防御4-4，魔御1-2，魔法0-1"
  },
  {
      "key": "I641",
      "name": "F法神头盔1",
      "text": "需要魔法力32，防御4-5，魔御1-3，魔法0-2(极品魔法、防御+1)"
  },
  {
      "key": "I642",
      "name": "F法神头盔2",
      "text": "需要魔法力32，防御4-6，魔御1-4，魔法0-3(极品魔法、防御+2)"
  },
  {
      "key": "I643",
      "name": "F法神头盔3",
      "text": "需要魔法力32，防御4-7，魔御1-5，魔法0-4(极品魔法、防御+3)"
  },
  {
      "key": "I644",
      "name": "D通云道衣2",
      "text": "需要等级55，防御15-29，魔御15-24，道术5-14"
  },
  {
      "key": "I645",
      "name": "D通云道衣3",
      "text": "需要等级55，防御15-31，魔御15-26，道术5-16"
  },
  {
      "key": "I646",
      "name": "F黑檀项链",
      "text": "需要等级13，魔法0-1，魔防0-1"
  },
  {
      "key": "I647",
      "name": "F白金项链",
      "text": "需要魔法力10，魔法0-2"
  },
  {
      "key": "I648",
      "name": "F琥珀项链",
      "text": "需要等级17，魔法1-2"
  },
  {
      "key": "I649",
      "name": "F放大镜",
      "text": "需要等级24，魔法1-3"
  },
  {
      "key": "I650",
      "name": "F放大镜1",
      "text": "需要等级24，魔法1-4(极品魔法+1)"
  },
  {
      "key": "I651",
      "name": "F放大镜2",
      "text": "需要等级24，魔法1-5(极品魔法+2)"
  },
  {
      "key": "I652",
      "name": "F生命项链",
      "text": "需要魔法力25，魔法1-5"
  },
  {
      "key": "I653",
      "name": "F生命项链1",
      "text": "需要魔法力25，魔法1-6(极品魔法+1)"
  },
  {
      "key": "I654",
      "name": "F生命项链2",
      "text": "需要魔法力25，魔法1-7(极品魔法+2)"
  },
  {
      "key": "I655",
      "name": "F恶魔铃铛",
      "text": "需要魔法力29，魔法1-7"
  },
  {
      "key": "I656",
      "name": "F恶魔铃铛1",
      "text": "需要魔法力29，魔法1-8(极品魔法+1)"
  },
  {
      "key": "I657",
      "name": "F恶魔铃铛2",
      "text": "需要魔法力29，魔法1-9(极品魔法+2)"
  },
  {
      "key": "I658",
      "name": "F法神项链",
      "text": "需要魔法力32，魔法1-9"
  },
  {
      "key": "I659",
      "name": "F法神项链1",
      "text": "需要魔法力32，魔法1-10(极品魔法+1)"
  },
  {
      "key": "I660",
      "name": "F法神项链2",
      "text": "需要魔法力32，魔法1-11(极品魔法+2)"
  },
  {
      "key": "I661",
      "name": "F法神项链3",
      "text": "需要魔法力32，魔法1-12(极品魔法+3)"
  },
  {
      "key": "I662",
      "name": "D通云道衣4",
      "text": "需要等级55，防御15-31，魔御15-26，道术5-16"
  },
  {
      "key": "I663",
      "name": "D通云道衣5",
      "text": "需要等级55，防御15-35，魔御15-30，道术5-20"
  },
  {
      "key": "I664",
      "name": "F黑檀手镯",
      "text": "需要等级19，魔法0-1"
  },
  {
      "key": "I665",
      "name": "F思贝儿手镯",
      "text": "需要魔法力24，魔法0-2"
  },
  {
      "key": "I666",
      "name": "F思贝儿手镯1",
      "text": "需要魔法力24，魔法0-3(极品魔法+1)"
  },
  {
      "key": "I667",
      "name": "F思贝儿手镯2",
      "text": "需要魔法力24，魔法0-4(极品魔法+2)"
  },
  {
      "key": "I668",
      "name": "F龙之手镯",
      "text": "需要魔法力28，魔法0-3"
  },
  {
      "key": "I669",
      "name": "F龙之手镯1",
      "text": "需要魔法力28，魔法0-4(极品魔法+1)"
  },
  {
      "key": "I670",
      "name": "F龙之手镯2",
      "text": "需要魔法力28，魔法0-5(极品魔法+2)"
  },
  {
      "key": "I671",
      "name": "F法神手镯",
      "text": "需要魔法力32，防御0-1，魔法0-4"
  },
  {
      "key": "I672",
      "name": "F法神手镯1",
      "text": "需要魔法力32，防御0-1，魔法0-5(极品魔法+1)"
  },
  {
      "key": "I673",
      "name": "F法神手镯2",
      "text": "需要魔法力32，防御0-1，魔法0-6(极品魔法+2)"
  },
  {
      "key": "I674",
      "name": "F法神手镯3",
      "text": "需要魔法力32，防御0-1，魔法0-7(极品魔法+3)"
  },
  {
      "key": "I675",
      "name": "Z狂雷项链",
      "text": "需要等级55，攻击5-20（具有记忆项链的效果）（如果发现不触发，请取下，关闭装备框，再佩戴，再关闭装备框）"
  },
  {
      "key": "I676",
      "name": "Z狂雷项链1",
      "text": "需要等级55，攻击5-22（具有记忆项链的效果）"
  },
  {
      "key": "I677",
      "name": "F蛇眼戒指",
      "text": "需要等级20，魔法0-2"
  },
  {
      "key": "I678",
      "name": "F魅力戒指",
      "text": "需要等级23，魔法1-2"
  },
  {
      "key": "I679",
      "name": "F魅力戒指1",
      "text": "需要等级23，魔法1-3(极品魔法+1)"
  },
  {
      "key": "I680",
      "name": "F魅力戒指2",
      "text": "需要等级23，魔法1-4(极品魔法+2)"
  },
  {
      "key": "I681",
      "name": "F红宝石戒指",
      "text": "需要魔法力17，魔法0-4"
  },
  {
      "key": "I682",
      "name": "F红宝石戒指1",
      "text": "需要魔法力17，魔法0-5(极品魔法+1)"
  },
  {
      "key": "I683",
      "name": "F红宝石戒指2",
      "text": "需要魔法力17，魔法0-6(极品魔法+2)"
  },
  {
      "key": "I684",
      "name": "F紫碧螺",
      "text": "需要魔法力24，魔法0-5"
  },
  {
      "key": "I685",
      "name": "F紫碧螺1",
      "text": "需要魔法力24，魔法0-6(极品魔法+1)"
  },
  {
      "key": "I686",
      "name": "F紫碧螺2",
      "text": "需要魔法力24，魔法0-7(极品魔法+2)"
  },
  {
      "key": "I687",
      "name": "F法神戒指",
      "text": "需要魔法力32，魔防0-1，魔法1-6"
  },
  {
      "key": "I688",
      "name": "F法神戒指1",
      "text": "需要魔法力32，魔防0-1，魔法1-7(极品魔法+1)"
  },
  {
      "key": "I689",
      "name": "F法神戒指2",
      "text": "需要魔法力32，魔防0-1，魔法1-8(极品魔法+2)"
  },
  {
      "key": "I690",
      "name": "F法神戒指3",
      "text": "需要魔法力32，魔防0-1，魔法1-9(极品魔法+3)"
  },
  {
      "key": "I691",
      "name": "Z狂雷项链2",
      "text": "需要等级55，攻击5-24（具有记忆项链的效果）"
  },
  {
      "key": "I692",
      "name": "Z狂雷项链3",
      "text": "需要等级55，攻击5-26（具有记忆项链的效果）"
  },
  {
      "key": "I694",
      "name": "Z狂雷项链4",
      "text": "需要等级55，攻击5-28（具有记忆项链的效果）"
  },
  {
      "key": "I695",
      "name": "Z狂雷项链5",
      "text": "需要等级55，攻击5-30（具有记忆项链的效果）"
  },
  // {
  //     "key": "I700",
  //     "name": "祖玛头像",
  //     "text": "祖玛教主爆，找NPC提交可攻城"
  // },
  {
      "key": "I701",
      "name": "金矿",
      "text": "可以一键回收卖钱,售价1000金币",
      "count": 99999
  },
  {
      "key": "I702",
      "name": "铜矿",
      "text": "可以一键回收卖钱,售价200金币",
      "count": 99999
  },
  {
      "key": "I703",
      "name": "黑铁矿石",
      "text": "升级武器的必要材料",
      "count": 9999999
  },
  {
      "key": "I704",
      "name": "银矿",
      "text": "可以一键回收卖钱,售价500金币",
      "count": 99999
  },
  {
      "key": "I705",
      "name": "铁矿",
      "text": "可以一键回收卖钱,售价300金币",
      "count": 99999
  },
  {
      "key": "I707",
      "name": "骰子1",
      "text": "活动道具,在活动员处可以兑换丰富奖励,甚至终极装备",
      "count": 99999
  },
  {
      "key": "I708",
      "name": "骰子2",
      "text": "活动道具,在活动员处可以兑换丰富奖励,甚至终极装备",
      "count": 99999
  },
  {
      "key": "I709",
      "name": "骰子3",
      "text": "活动道具,在活动员处可以兑换丰富奖励,甚至终极装备",
      "count": 99999
  },
  {
      "key": "I710",
      "name": "骰子4",
      "text": "活动道具,在活动员处可以兑换丰富奖励,甚至终极装备",
      "count": 99999
  },
  {
      "key": "I711",
      "name": "骰子5",
      "text": "活动道具,在活动员处可以兑换丰富奖励,甚至终极装备",
      "count": 99999
  },
  {
      "key": "I712",
      "name": "骰子6",
      "text": "活动道具,在活动员处可以兑换丰富奖励,甚至终极装备",
      "count": 99999
  },
  // {
  //     "key": "I724",
  //     "name": "召唤骷髅",
  //     "text": "19级方可学习，每次召唤需要消耗100点魔力，等级+道术越高宝宝越强"
  // },
  // {
  //     "key": "I725",
  //     "name": "召唤神兽",
  //     "text": "35级方可学习，每次召唤需要消耗300点魔力，等级+道术越高宝宝越强"
  // },
  // {
  //     "key": "I726",
  //     "name": "治愈术",
  //     "text": "快捷键1或5，可以加血，消耗时间3秒，等级越高耗蓝+加血越高（可在战斗动画中给宝宝加血，但是消耗金币，用之前先双击本道具并设置）"
  // },
  // {
  //     "key": "I727",
  //     "name": "隐身术2",
  //     "text": "消耗80点魔力，使用隐身术可以在本层穿越怪并不受到攻击，再次使用取消隐身术(特殊地图除外，BUG多尽量少用)"
  // },
  // {
  //     "key": "I784",
  //     "name": "新版施毒术",
  //     "text": "快捷键7，-50点魔，对面前的怪施毒降低防御，不能重复使用（请面对面对怪物,按Z键可以让角色转向）（可在内挂中切换老版施毒术）"
  // },
  // {
  //     "key": "I785",
  //     "name": "灵魂火符",
  //     "text": "快捷键3，道士前期唯一远程攻击，请面对面怪使用。（使用前先双击本道具进行设置）"
  // },
  // {
  //     "key": "I786",
  //     "name": "隐身术",
  //     "text": "消耗80点魔力，使用隐身术可以在本层穿越怪并不受到攻击，再次使用取消隐身术(特殊地图除外，BUG多尽量少用)，可在内挂里改为传送隐身术且没BUG。"
  // },
  {
      "key": "I787",
      "name": "D赤血魔剑",
      "text": "需要等级35，道术3-11(比原版要加强一点)"
  },
  {
      "key": "I788",
      "name": "D半月",
      "text": "需要等级15，道术1-1，魔防0-2(做了微调)"
  },
  {
      "key": "I789",
      "name": "D降魔",
      "text": "需要等级20，道术1-2，魔防0-4(做了微调)"
  },
  {
      "key": "I790",
      "name": "D银蛇",
      "text": "需要等级25，道术1-3"
  },
  {
      "key": "I791",
      "name": "D银蛇1",
      "text": "需要等级25，道术1-4(极品道术+1)"
  },
  {
      "key": "I792",
      "name": "D银蛇2",
      "text": "需要等级25，道术1-5(极品道术+2)"
  },
  {
      "key": "I793",
      "name": "D无极棍",
      "text": "需要精神力25，道术3-5"
  },
  {
      "key": "I794",
      "name": "D无极棍1",
      "text": "需要精神力25，道术3-6(极品道术+1)"
  },
  {
      "key": "I795",
      "name": "D无极棍2",
      "text": "需要精神力25，道术3-7(极品道术+2)"
  },
  {
      "key": "I796",
      "name": "D龙纹剑",
      "text": "需要等级35，道术3-6"
  },
  {
      "key": "I797",
      "name": "D龙纹剑1",
      "text": "需要等级35，道术3-8(极品道术+2)"
  },
  {
      "key": "I798",
      "name": "D龙纹剑2",
      "text": "需要等级35，道术3-10(极品道术+4)"
  },
  {
      "key": "I799",
      "name": "D霸者之刃",
      "text": "需要等级40，道术3-8"
  },
  {
      "key": "I800",
      "name": "D霸者之刃1",
      "text": "需要等级40，道术3-10(极品道术+2)"
  },
  {
      "key": "I801",
      "name": "D霸者之刃2",
      "text": "需要等级40，道术3-12(极品道术+4)"
  },
  {
      "key": "I802",
      "name": "D霸者之刃3",
      "text": "需要等级40，道术3-15(极品道术+7)"
  },
  {
      "key": "I803",
      "name": "D逍遥扇",
      "text": "需要等级40，道术3-10"
  },
  {
      "key": "I804",
      "name": "D逍遥扇1",
      "text": "需要等级40，道术3-12(极品道术+2)"
  },
  {
      "key": "I805",
      "name": "D逍遥扇2",
      "text": "需要等级40，道术3-14(极品道术+4)"
  },
  {
      "key": "I806",
      "name": "D逍遥扇3",
      "text": "需要等级40，道术3-17(极品道术+7)"
  },
  {
      "key": "I807",
      "name": "D双七逍遥扇",
      "text": "需要等级45，道术+7，真正的超级武器"
  },
  // {
  //     "key": "I808",
  //     "name": "老版施毒术",
  //     "text": "快捷键7，-50点魔，对面前的怪施毒降低防御和生命，可重复使用但有时间间隔（请面对面对怪物,按Z键可以让角色转向）（可在内挂中切换新版施毒术）"
  // },
  {
      "key": "I809",
      "name": "D灵魂战衣男",
      "text": "需要等级22，防御3-6，魔防3-3，道术0-2"
  },
  {
      "key": "I810",
      "name": "D灵魂战衣男1",
      "text": "需要等级22，防御3-7，魔防3-4，道术0-3(极品道术、防御+1)"
  },
  {
      "key": "I811",
      "name": "D灵魂战衣男2",
      "text": "需要等级22，防御3-8，魔防3-5，道术0-4(极品道术、防御+2)"
  },
  {
      "key": "I812",
      "name": "D幽灵战衣男",
      "text": "需要精神力27，防御4-7，魔防3-4，道术1-4"
  },
  {
      "key": "I813",
      "name": "D幽灵战衣男1",
      "text": "需要精神力27，防御4-8，魔防3-5，道术1-5(极品道术、防御+1)"
  },
  {
      "key": "I814",
      "name": "D幽灵战衣男2",
      "text": "需要精神力27，防御4-9，魔防3-6，道术1-6(极品道术、防御+2)"
  },
  {
      "key": "I815",
      "name": "D天尊道袍",
      "text": "需要等级40，防御4-9，魔防4-6，道术2-5"
  },
  {
      "key": "I816",
      "name": "D天尊道袍1",
      "text": "需要等级40，防御4-10，魔防4-7，道术2-6(极品道术、防御+1)"
  },
  {
      "key": "I817",
      "name": "D天尊道袍2",
      "text": "需要等级40，防御4-11，魔防4-8，道术2-7(极品道术、防御+2)"
  },
  {
      "key": "I818",
      "name": "D天尊道袍3",
      "text": "需要等级40，防御4-12，魔防4-9，道术2-8(极品道术、防御+3)"
  },
  {
      "key": "I820",
      "name": "D天尊头盔",
      "text": "需要精神力40，防御4-4，魔防1-2，道术0-1"
  },
  {
      "key": "I821",
      "name": "D天尊头盔1",
      "text": "需要精神力40，防御4-5，魔防1-3，道术0-2(极品道术、防御+1)"
  },
  {
      "key": "I822",
      "name": "D天尊头盔2",
      "text": "需要精神力40，防御4-6，魔防1-4，道术0-3(极品道术、防御+2)"
  },
  {
      "key": "I823",
      "name": "D天尊头盔3",
      "text": "需要精神力40，防御4-7，魔防1-5，道术0-4(极品道术、防御+3)"
  },
  {
      "key": "I825",
      "name": "D黑色水晶项链",
      "text": "需要等级13，道术1-1"
  },
  {
      "key": "I826",
      "name": "D凤凰明珠",
      "text": "需要等级17，道术1-2"
  },
  {
      "key": "I827",
      "name": "D竹笛",
      "text": "需要等级24，道术1-3"
  },
  {
      "key": "I828",
      "name": "D竹笛1",
      "text": "需要等级24，道术1-4(极品道术+1)"
  },
  {
      "key": "I829",
      "name": "D竹笛2",
      "text": "需要等级24，道术1-5(极品道术+2)"
  },
  {
      "key": "I830",
      "name": "D天珠项链",
      "text": "需要精神力22，道术1-5"
  },
  {
      "key": "I831",
      "name": "D天珠项链1",
      "text": "需要精神力22，道术1-6(极品道术+1)"
  },
  {
      "key": "I832",
      "name": "D天珠项链2",
      "text": "需要精神力22，道术1-7(极品道术+2)"
  },
  {
      "key": "I833",
      "name": "D灵魂项链",
      "text": "需要精神力23，道术1-6"
  },
  {
      "key": "I834",
      "name": "D灵魂项链1",
      "text": "需要精神力23，道术1-7(极品道术+1)"
  },
  {
      "key": "I835",
      "name": "D灵魂项链2",
      "text": "需要精神力23，道术1-8(极品道术+2)"
  },
  {
      "key": "I836",
      "name": "D天尊项链",
      "text": "需要精神力40，道术2-7"
  },
  {
      "key": "I837",
      "name": "D天尊项链1",
      "text": "需要精神力40，道术2-8(极品道术+1)"
  },
  {
      "key": "I838",
      "name": "D天尊项链2",
      "text": "需要精神力40，道术2-9(极品道术+2)"
  },
  {
      "key": "I839",
      "name": "D天尊项链3",
      "text": "需要精神力40，道术2-10(极品道术+3)"
  },
  {
      "key": "I841",
      "name": "D道士手镯",
      "text": "需要等级19，道术0-1"
  },
  {
      "key": "I842",
      "name": "D心灵手镯",
      "text": "需要精神力24，道术1-2"
  },
  {
      "key": "I843",
      "name": "D心灵手镯1",
      "text": "需要精神力24，道术1-3(极品道术+1)"
  },
  {
      "key": "I844",
      "name": "D心灵手镯2",
      "text": "需要精神力24，道术1-4(极品道术+2)"
  },
  {
      "key": "I845",
      "name": "D三眼手镯",
      "text": "需要精神力28，道术1-3，防御1-1"
  },
  {
      "key": "I846",
      "name": "D三眼手镯1",
      "text": "需要精神力28，道术1-4，防御1-1(极品道术+1)"
  },
  {
      "key": "I847",
      "name": "D三眼手镯2",
      "text": "需要精神力28，道术1-5，防御1-1(极品道术+2)"
  },
  {
      "key": "I848",
      "name": "D天尊手镯",
      "text": "需要精神力40，防御1-2，道术1-4"
  },
  {
      "key": "I849",
      "name": "D天尊手镯1",
      "text": "需要精神力40，防御1-2，道术1-5(极品道术+1)"
  },
  {
      "key": "I850",
      "name": "D天尊手镯2",
      "text": "需要精神力40，防御1-2，道术1-6(极品道术+2)"
  },
  {
      "key": "I851",
      "name": "D天尊手镯3",
      "text": "需要精神力40，防御1-2，道术1-7(极品道术+3)"
  },
  {
      "key": "I853",
      "name": "D珍珠戒指",
      "text": "需要等级20，道术0-2"
  },
  {
      "key": "I854",
      "name": "D道德戒指",
      "text": "需要等级23，道术1-2"
  },
  {
      "key": "I855",
      "name": "D道德戒指1",
      "text": "需要等级23，道术1-3(极品道术+1)"
  },
  {
      "key": "I856",
      "name": "D道德戒指2",
      "text": "需要等级23，道术1-4(极品道术+2)"
  },
  {
      "key": "I857",
      "name": "D铂金戒指",
      "text": "需要精神力17，道术0-4"
  },
  {
      "key": "I858",
      "name": "D铂金戒指1",
      "text": "需要精神力17，道术0-5(极品道术+1)"
  },
  {
      "key": "I859",
      "name": "D铂金戒指2",
      "text": "需要精神力17，道术0-6(极品道术+2)"
  },
  {
      "key": "I860",
      "name": "D泰坦戒指",
      "text": "需要精神力24，道术2-6"
  },
  {
      "key": "I861",
      "name": "D泰坦戒指1",
      "text": "需要精神力24，道术2-7(极品道术+1)"
  },
  {
      "key": "I862",
      "name": "D泰坦戒指2",
      "text": "需要精神力24，道术2-8(极品道术+2)"
  },
  {
      "key": "I863",
      "name": "D天尊戒指",
      "text": "需要精神力40，魔防0-1，道术2-7"
  },
  {
      "key": "I864",
      "name": "D天尊戒指1",
      "text": "需要精神力40，魔防0-1，道术2-8(极品道术+1)"
  },
  {
      "key": "I865",
      "name": "D天尊戒指2",
      "text": "需要精神力40，魔防0-1，道术2-9(极品道术+2)"
  },
  {
      "key": "I866",
      "name": "D天尊戒指3",
      "text": "需要精神力40，魔防0-1，道术2-10(极品道术+3)"
  },
  {
      "key": "I869",
      "name": "F逆火魔链",
      "text": "需要等级55，魔法5-20（具有灯笼项链的效果）（如果发现不触发，请取下，关闭装备框，再佩戴，再关闭装备框）"
  },
  {
      "key": "I870",
      "name": "F逆火魔链1",
      "text": "需要等级55，魔法5-21（具有灯笼项链的效果）"
  },
  {
      "key": "I871",
      "name": "F逆火魔链2",
      "text": "需要等级55，魔法5-22（具有灯笼项链的效果）"
  },
  {
      "key": "I872",
      "name": "F逆火魔链3",
      "text": "需要等级55，魔法5-23（具有灯笼项链的效果）"
  },
  {
      "key": "I873",
      "name": "【全】布衣女2",
      "text": "防御0-2"
  },
  {
      "key": "I874",
      "name": "【全】轻型盔甲女2",
      "text": "需要等级11，防御3-3，魔御1-2"
  },
  {
      "key": "I875",
      "name": "【全】中型盔甲女2",
      "text": "需要等级16，防御3-5，魔御1-2"
  },
  {
      "key": "I876",
      "name": "Z重盔甲女",
      "text": "需要等级22，防御4-7，魔御2-3"
  },
  {
      "key": "I877",
      "name": "Z重盔甲女攻击1",
      "text": "需要等级22，防御4-7，魔御2-3，攻击0-1(极品攻击+1)"
  },
  {
      "key": "I878",
      "name": "Z重盔甲女攻击2",
      "text": "需要等级22，防御4-7，魔御2-3，攻击0-2(极品攻击+2)"
  },
  {
      "key": "I879",
      "name": "Z重盔甲女防御1",
      "text": "需要等级22，防御4-8，魔御2-4(极品防御+1)"
  },
  {
      "key": "I880",
      "name": "Z重盔甲女防御2",
      "text": "需要等级22，防御4-9，魔御2-5(极品防御+2)"
  },
  {
      "key": "I882",
      "name": "Z战神盔甲女",
      "text": "需要攻击力48，防御5-9，魔御3-5"
  },
  {
      "key": "I883",
      "name": "Z战神盔甲女攻击1",
      "text": "需要攻击力48，防御5-9，魔御3-5，攻击0-1(极品攻击+1)"
  },
  {
      "key": "I884",
      "name": "Z战神盔甲女攻击2",
      "text": "需要攻击力48，防御5-9，魔御3-5，攻击0-2(极品攻击+2)"
  },
  {
      "key": "I885",
      "name": "Z战神盔甲女防御1",
      "text": "需要攻击力48，防御5-10，魔御3-6(极品防御+1)"
  },
  {
      "key": "I886",
      "name": "Z战神盔甲女防御2",
      "text": "需要攻击力48，防御5-11，魔御3-7(极品防御+2)"
  },
  {
      "key": "I887",
      "name": "Z圣战宝甲",
      "text": "需要等级40，防御5-12，魔御4-7，攻击1-2"
  },
  {
      "key": "I888",
      "name": "Z圣战宝甲1",
      "text": "需要等级40，防御5-13，魔御4-8，攻击1-3(极品全属性+1) "
  },
  {
      "key": "I889",
      "name": "Z圣战宝甲2",
      "text": "需要等级40，防御5-14，魔御4-9，攻击1-4(极品全属性+2) "
  },
  {
      "key": "I890",
      "name": "Z圣战宝甲3",
      "text": "需要等级40，防御5-15，魔御4-10，攻击1-5(极品全属性+3) "
  },
  {
      "key": "I891",
      "name": "F魔法长袍女",
      "text": "需要等级22，防御3-5，魔御3-4，魔法0-2"
  },
  {
      "key": "I892",
      "name": "F魔法长袍女1",
      "text": "需要等级22，防御3-6，魔御3-5，魔法0-3(极品魔法、防御+1)"
  },
  {
      "key": "I893",
      "name": "F魔法长袍女2",
      "text": "需要等级22，防御3-7，魔御3-6，魔法0-4(极品魔法、防御+2)"
  },
  {
      "key": "I895",
      "name": "F恶魔长袍女",
      "text": "需要魔法力28，防御4-7，魔御3-4，魔法1-4"
  },
  {
      "key": "I896",
      "name": "F恶魔长袍女1",
      "text": "需要魔法力28，防御4-8，魔御3-5，魔法1-5(极品魔法、防御+1)"
  },
  {
      "key": "I897",
      "name": "F恶魔长袍女2",
      "text": "需要魔法力28，防御4-9，魔御3-6，魔法1-6(极品魔法、防御+2)"
  },
  {
      "key": "I898",
      "name": "F霓裳羽衣",
      "text": "需要等级40，防御4-9，魔御4-6，魔法2-5"
  },
  {
      "key": "I899",
      "name": "F霓裳羽衣1",
      "text": "需要等级40，防御4-10，魔御4-7，魔法2-6(极品魔法、防御+1)"
  },
  {
      "key": "I900",
      "name": "F霓裳羽衣2",
      "text": "需要等级40，防御4-11，魔御4-8，魔法2-7(极品魔法、防御+2)"
  },
  {
      "key": "I901",
      "name": "F霓裳羽衣3",
      "text": "需要等级40，防御4-12，魔御4-9，魔法2-8(极品魔法、防御+3)"
  },
  {
      "key": "I903",
      "name": "D灵魂战衣女",
      "text": "需要等级22，防御3-6，魔防3-3，道术0-2"
  },
  {
      "key": "I904",
      "name": "D灵魂战衣女1",
      "text": "需要等级22，防御3-7，魔防3-4，道术0-3(极品道术、防御+1)"
  },
  {
      "key": "I905",
      "name": "D灵魂战衣女2",
      "text": "需要等级22，防御3-8，魔防3-5，道术0-4(极品道术、防御+2)"
  },
  {
      "key": "I907",
      "name": "D幽灵战衣女",
      "text": "需要精神力27，防御4-7，魔防3-4，道术1-4"
  },
  {
      "key": "I908",
      "name": "D幽灵战衣女1",
      "text": "需要精神力27，防御4-8，魔防3-5，道术1-5(极品道术、防御+1)"
  },
  {
      "key": "I909",
      "name": "D幽灵战衣女2",
      "text": "需要精神力27，防御4-9，魔防3-6，道术1-6(极品道术、防御+2)"
  },
  {
      "key": "I910",
      "name": "D天师长袍",
      "text": "需要等级40，防御4-9，魔防4-6，道术2-5"
  },
  {
      "key": "I911",
      "name": "D天师长袍1",
      "text": "需要等级40，防御4-10，魔防4-7，道术2-6(极品道术、防御+1)"
  },
  {
      "key": "I912",
      "name": "D天师长袍2",
      "text": "需要等级40，防御4-11，魔防4-8，道术2-7(极品道术、防御+2)"
  },
  {
      "key": "I913",
      "name": "D天师长袍3",
      "text": "需要等级40，防御4-12，魔防4-9，道术2-8(极品道术、防御+3)"
  },
  {
      "key": "I941",
      "name": "永久三倍经验",
      "text": "可以和其他涨经验的道具叠加使用（永久的除外）"
  },
  {
      "key": "I942",
      "name": "永久双倍经验",
      "text": "可以和其他涨经验的道具叠加使用（永久的除外）"
  },
  {
      "key": "I943",
      "name": "永久四倍经验",
      "text": "可以和其他涨经验的道具叠加使用（永久的除外）"
  },
  // {
  //     "key": "I946",
  //     "name": "刺杀剑法",
  //     "text": "战斗时后面的怪也会受到溅射伤害（无视防御），伤害与攻击次数、攻击力有关（需关闭半月弯刀，按Z键可以让角色转向）"
  // },
  // {
  //     "key": "I947",
  //     "name": "半月弯刀",
  //     "text": "消耗50点魔力，战斗时旁边的怪也会受到溅射伤害，伤害与攻击次数、攻击力有关（需关闭刺杀剑法）"
  // },
  // {
  //     "key": "I948",
  //     "name": "烈火剑法",
  //     "text": "双击后可打开关闭自动使用烈火，一刀一个小朋友，秒天秒地秒空气！（攻击越高烈火造成的伤害越高，无视防御，每10刀触发1下）"
  // },
  // {
  //     "key": "I949",
  //     "name": "基本剑术",
  //     "text": "战士初级剑术，被动技能，原版是增加准确度（本版本改为增加0-5的攻击）"
  // },
  // {
  //     "key": "I950",
  //     "name": "攻杀剑术",
  //     "text": "战士初级剑术，被动技能，原版是发动技能（本版本改为增加5-0的攻击力）"
  // },
  {
      "key": "I951",
      "name": "超级祝福油",
      "text": "可以增加角色幸运值，幸运值越高发挥最强攻击的概率就越大，最高幸运+7（取消了战斗动画的本道具无效）",
      "count": 999999
  },
  // {
  //     "key": "I958",
  //     "name": "卧龙古书",
  //     "text": "集齐5本古书即可开启藏宝图，如果离开卧龙山庄，本道具无任何效果，每次进入山庄本古书会清零"
  // },
  {
      "key": "I962",
      "name": "恶魔之心",
      "text": "据说最强武器与本道具有关",
      "count": 999
  },
  {
      "key": "I966",
      "name": "F逆火魔链4",
      "text": "需要等级55，魔法5-24（具有灯笼项链的效果）"
  },
  {
      "key": "I967",
      "name": "F逆火魔链5",
      "text": "需要等级55，魔法5-25（具有灯笼项链的效果）"
  },
  {
      "key": "I968",
      "name": "D通云道链",
      "text": "需要等级55，道术5-20（具有白色虎齿项链的效果）（如果发现不触发，请取下，关闭装备框，再佩戴，再关闭装备框）"
  },
  {
      "key": "I969",
      "name": "Z记忆项链",
      "text": "需要等级26，攻击2-4"
  },
  {
      "key": "I970",
      "name": "Z记忆项链1",
      "text": "需要等级26，攻击2-5(极品攻击+1)"
  },
  {
      "key": "I971",
      "name": "Z记忆项链2",
      "text": "需要等级26，攻击2-6(极品攻击+2)"
  },
  {
      "key": "I972",
      "name": "Z记忆项链3",
      "text": "需要等级26，攻击2-7(极品攻击+3)"
  },
  {
      "key": "I973",
      "name": "D白色虎齿项链",
      "text": "需要精神力11，道术0-1，魔防1-2，躲避+2"
  },
  {
      "key": "I974",
      "name": "D白色虎齿项链1",
      "text": "需要精神力11，道术0-2，魔防1-2，躲避+2(极品道术+1)"
  },
  {
      "key": "I975",
      "name": "D白色虎齿项链2",
      "text": "需要精神力11，道术0-3，魔防1-2，躲避+2(极品道术+2)"
  },
  {
      "key": "I976",
      "name": "D白色虎齿项链3",
      "text": "需要精神力11，道术0-4，魔防1-2，躲避+2(极品道术+3)"
  },
  {
      "key": "I977",
      "name": "F灯笼项链",
      "text": "需要等级18，魔法0-1，躲避+2(跟原版做了调整)"
  },
  {
      "key": "I978",
      "name": "F灯笼项链1",
      "text": "需要等级18，魔法0-2，躲避+2(极品魔法+1)(跟原版做了调整)"
  },
  {
      "key": "I979",
      "name": "F灯笼项链2",
      "text": "需要等级18，魔法0-3，躲避+2(极品魔法+2)(跟原版做了调整)"
  },
  {
      "key": "I980",
      "name": "F灯笼项链3",
      "text": "需要等级18，魔法0-4，躲避+2(极品魔法+3)(跟原版做了调整)"
  },
  {
      "key": "I1040",
      "name": "荣誉勋章碎片",
      "text": "勋章碎片，双击可使用可以兑换勋章。（圣域之门爆出，幻境10和封魔殿可前往圣域）",
      "count": 99999
  },
  {
      "key": "I1041",
      "name": "D通云道链1",
      "text": "需要等级55，道术5-22（具有白色虎齿项链的效果）"
  },
  {
      "key": "I1042",
      "name": "D通云道链2",
      "text": "需要等级55，道术5-24（具有白色虎齿项链的效果）"
  },
  {
      "key": "I1043",
      "name": "D通云道链3",
      "text": "需要等级55，道术5-26（具有白色虎齿项链的效果）"
  },
  {
      "key": "I1044",
      "name": "D通云道链4",
      "text": "需要等级55，道术5-28（具有白色虎齿项链的效果）"
  },
  {
      "key": "I1045",
      "name": "荣誉勋章11号",
      "text": "需要等级5，防御0-1"
  },
  {
      "key": "I1046",
      "name": "荣誉勋章12号",
      "text": "需要等级5，魔御0-1，"
  },
  {
      "key": "I1047",
      "name": "荣誉勋章13号",
      "text": "需要等级5，攻击0-1"
  },
  {
      "key": "I1048",
      "name": "荣誉勋章14号",
      "text": "需要等级5，魔法0-1"
  },
  {
      "key": "I1049",
      "name": "荣誉勋章15号",
      "text": "需要等级5，道术0-1"
  },
  {
      "key": "I1050",
      "name": "荣誉勋章21号",
      "text": "需要等级10，防御0-2"
  },
  {
      "key": "I1051",
      "name": "荣誉勋章22号",
      "text": "需要等级10，魔御0-2"
  },
  {
      "key": "I1052",
      "name": "荣誉勋章23号",
      "text": "需要等级10，攻击0-2"
  },
  {
      "key": "I1053",
      "name": "荣誉勋章24号",
      "text": "需要等级10，魔法0-2"
  },
  {
      "key": "I1054",
      "name": "荣誉勋章25号",
      "text": "需要等级10，道术0-2"
  },
  {
      "key": "I1055",
      "name": "荣誉勋章31号",
      "text": "需要等级15，防御1-2"
  },
  {
      "key": "I1056",
      "name": "荣誉勋章32号",
      "text": "需要等级15，魔御1-2"
  },
  {
      "key": "I1057",
      "name": "荣誉勋章33号",
      "text": "需要等级15，攻击1-2"
  },
  {
      "key": "I1058",
      "name": "荣誉勋章34号",
      "text": "需要等级15，魔法1-2"
  },
  {
      "key": "I1059",
      "name": "荣誉勋章35号",
      "text": "需要等级15，道术1-2"
  },
  {
      "key": "I1060",
      "name": "荣誉勋章41号",
      "text": "需要等级20，防御1-3"
  },
  {
      "key": "I1061",
      "name": "荣誉勋章42号",
      "text": "需要等级20，魔御1-3"
  },
  {
      "key": "I1062",
      "name": "荣誉勋章43号",
      "text": "需要等级20，攻击1-3"
  },
  {
      "key": "I1063",
      "name": "荣誉勋章44号",
      "text": "需要等级20，魔法1-3"
  },
  {
      "key": "I1064",
      "name": "荣誉勋章45号",
      "text": "需要等级20，道术1-3"
  },
  {
      "key": "I1065",
      "name": "Z狂雷战甲",
      "text": "需要等级55，防御15-25，魔御15-20，攻击5-10"
  },
  {
      "key": "I1066",
      "name": "Z狂雷战甲1",
      "text": "需要等级55，防御15-27，魔御15-22，攻击5-12"
  },
  {
      "key": "I1067",
      "name": "Z狂雷战甲2",
      "text": "需要等级55，防御15-29，魔御15-24，攻击5-14"
  },
  {
      "key": "I1068",
      "name": "Z狂雷战甲3",
      "text": "需要等级55，防御15-31，魔御15-26，攻击5-16"
  },
  {
      "key": "I1069",
      "name": "Z狂雷战甲4",
      "text": "需要等级55，防御15-33，魔御15-28，攻击5-18"
  },
  {
      "key": "I1070",
      "name": "Z狂雷战甲5",
      "text": "需要等级55，防御15-35，魔御15-30，攻击5-20"
  },
  {
      "key": "I1071",
      "name": "Z狂雷战衣",
      "text": "需要等级55，防御15-25，魔御15-20，攻击5-10"
  },
  {
      "key": "I1072",
      "name": "Z狂雷战衣1",
      "text": "需要等级55，防御15-27，魔御15-22，攻击5-12"
  },
  {
      "key": "I1073",
      "name": "Z狂雷战衣2",
      "text": "需要等级55，防御15-29，魔御15-24，攻击5-14"
  },
  {
      "key": "I1074",
      "name": "Z狂雷战衣3",
      "text": "需要等级55，防御15-31，魔御15-26，攻击5-16"
  },
  {
      "key": "I1075",
      "name": "Z狂雷战衣4",
      "text": "需要等级55，防御15-31，魔御15-26，攻击5-16"
  },
  {
      "key": "I1076",
      "name": "Z狂雷战衣5",
      "text": "需要等级55，防御15-35，魔御15-30，攻击5-20"
  },
  {
      "key": "I1077",
      "name": "兽皮腰带",
      "text": "需要等级15，防御0-1"
  },
  {
      "key": "I1078",
      "name": "铁腰带",
      "text": "需要等级22，防御0-2"
  },
  {
      "key": "I1079",
      "name": "青铜腰带",
      "text": "需要等级30，防御1-2，魔御0-1"
  },
  {
      "key": "I1080",
      "name": "钢铁腰带",
      "text": "需要等级35，防御0-3，魔御0-2"
  },
  {
      "key": "I1081",
      "name": "雷霆腰带",
      "text": "需要攻击力50，防御2-2，魔御0-1，攻击0-1"
  },
  {
      "key": "I1082",
      "name": "烈焰腰带",
      "text": "需要魔法力38，防御2-2，魔御0-1，魔法0-1"
  },
  {
      "key": "I1083",
      "name": "光芒腰带",
      "text": "需要精神力36，防御2-2，魔御0-1，道术0-1"
  },
  {
      "key": "I1084",
      "name": "战神腰带",
      "text": "需要攻击力60，防御3-4，魔御1-2，攻击1-2"
  },
  {
      "key": "I1085",
      "name": "圣魔腰带",
      "text": "需要魔法力40，防御3-4，魔御1-2，魔法1-2"
  },
  {
      "key": "I1086",
      "name": "真魂腰带",
      "text": "需要精神力38，防御3-4，魔御1-2，道术1-2"
  },
  {
      "key": "I1087",
      "name": "星王腰带战",
      "text": "需要等级47，防御2-3，魔御0-1，攻击0-4"
  },
  {
      "key": "I1088",
      "name": "星王腰带法",
      "text": "需要等级47，防御2-3，魔御0-1，魔法0-4"
  },
  {
      "key": "I1089",
      "name": "星王腰带道",
      "text": "需要等级47，防御2-3，魔御0-1，道术0-4"
  },
  {
      "key": "I1090",
      "name": "F逆火魔袍",
      "text": "需要等级55，防御15-25，魔御15-20，魔法5-10"
  },
  {
      "key": "I1091",
      "name": "F逆火魔袍1",
      "text": "需要等级55，防御15-27，魔御15-22，魔法5-11"
  },
  {
      "key": "I1092",
      "name": "F逆火魔袍2",
      "text": "需要等级55，防御15-29，魔御15-24，魔法5-12"
  },
  {
      "key": "I1093",
      "name": "F逆火魔袍3",
      "text": "需要等级55，防御15-31，魔御15-26，魔法5-13"
  },
  {
      "key": "I1094",
      "name": "布鞋",
      "text": "需要等级15，防御0-1"
  },
  {
      "key": "I1095",
      "name": "鹿皮靴",
      "text": "需要等级22，防御0-2"
  },
  {
      "key": "I1096",
      "name": "紫绸靴",
      "text": "需要等级30，防御0-3"
  },
  {
      "key": "I1097",
      "name": "避魂靴",
      "text": "需要等级35，防御1-3"
  },
  {
      "key": "I1098",
      "name": "雷霆战靴",
      "text": "需要攻击力50，防御0-3，攻击0-1"
  },
  {
      "key": "I1099",
      "name": "烈焰魔靴",
      "text": "需要魔法力40，防御0-3，魔法0-1"
  },
  {
      "key": "I1100",
      "name": "光芒道靴",
      "text": "需要精神力38，防御0-3，道术0-1"
  },
  {
      "key": "I1101",
      "name": "战神圣靴",
      "text": "需要攻击力65，防御1-4，攻击2-2"
  },
  {
      "key": "I1102",
      "name": "圣魔法靴",
      "text": "需要魔法力42，防御1-4，魔法2-2"
  },
  {
      "key": "I1103",
      "name": "真魂道靴",
      "text": "需要精神力40，防御1-4，道术2-2"
  },
  {
      "key": "I1104",
      "name": "F逆火魔袍4",
      "text": "需要等级55，防御15-33，魔御15-28，魔法5-14"
  },
  {
      "key": "I1105",
      "name": "F逆火魔袍5",
      "text": "需要等级55，防御15-35，魔御15-30，魔法5-15"
  },
  {
      "key": "I1106",
      "name": "F逆火魔衣",
      "text": "需要等级55，防御15-25，魔御15-20，魔法5-10"
  },
  {
      "key": "I1107",
      "name": "F逆火魔衣1",
      "text": "需要等级55，防御15-27，魔御15-22，魔法5-11"
  },
  {
      "key": "I1108",
      "name": "F逆火魔衣2",
      "text": "需要等级55，防御15-29，魔御15-24，魔法5-12"
  },
  {
      "key": "I1109",
      "name": "红碎石",
      "text": "需要等级30，防御0-1，攻击0-1"
  },
  {
      "key": "I1110",
      "name": "红碎石1",
      "text": "需要等级30，防御0-1，魔御0-1，攻击0-1"
  },
  {
      "key": "I1111",
      "name": "红碎石2",
      "text": "需要等级30，防御0-2，魔御0-1，攻击0-1"
  },
  {
      "key": "I1112",
      "name": "红碎石3",
      "text": "需要等级30，防御0-2，魔御0-2，攻击0-1"
  },
  {
      "key": "I1113",
      "name": "红碎石4",
      "text": "需要等级30，防御0-2，魔御0-2，攻击0-2"
  },
  {
      "key": "I1114",
      "name": "红宝石",
      "text": "需要等级40，防御0-1，魔御0-1，攻击0-2"
  },
  {
      "key": "I1115",
      "name": "红宝石1",
      "text": "需要等级40，防御0-2，魔御0-2，攻击0-2"
  },
  {
      "key": "I1116",
      "name": "红宝石2",
      "text": "需要等级40，防御0-2，魔御0-2，攻击0-3"
  },
  {
      "key": "I1117",
      "name": "红宝石3",
      "text": "需要等级40，防御1-2，魔御1-2，攻击0-3"
  },
  {
      "key": "I1118",
      "name": "红宝石4",
      "text": "需要等级40，防御1-2，魔御1-2，攻击1-3"
  },
  {
      "key": "I1119",
      "name": "蓝碎石",
      "text": "需要等级30，防御0-1，魔法0-1"
  },
  {
      "key": "I1120",
      "name": "蓝碎石1",
      "text": "需要等级30，防御0-1，魔御0-1，魔法0-1"
  },
  {
      "key": "I1121",
      "name": "蓝碎石2",
      "text": "需要等级30，防御0-2，魔御0-1，魔法0-1"
  },
  {
      "key": "I1122",
      "name": "蓝碎石3",
      "text": "需要等级30，防御0-2，魔御0-2，魔法0-1"
  },
  {
      "key": "I1123",
      "name": "蓝碎石4",
      "text": "需要等级30，防御0-2，魔御0-2，魔法0-2"
  },
  {
      "key": "I1124",
      "name": "蓝宝石",
      "text": "需要等级40，防御0-1，魔御0-1，魔法0-2"
  },
  {
      "key": "I1125",
      "name": "蓝宝石1",
      "text": "需要等级40，防御0-2，魔御0-2，魔法0-2"
  },
  {
      "key": "I1126",
      "name": "蓝宝石2",
      "text": "需要等级40，防御0-2，魔御0-2，魔法0-3"
  },
  {
      "key": "I1127",
      "name": "蓝宝石3",
      "text": "需要等级40，防御1-2，魔御1-2，魔法0-3"
  },
  {
      "key": "I1128",
      "name": "蓝宝石4",
      "text": "需要等级40，防御1-2，魔御1-2，魔法1-3"
  },
  {
      "key": "I1129",
      "name": "绿碎石",
      "text": "需要等级30，防御0-1，道术0-1"
  },
  {
      "key": "I1130",
      "name": "绿碎石1",
      "text": "需要等级30，防御0-1，魔御0-1，道术0-1"
  },
  {
      "key": "I1131",
      "name": "绿碎石2",
      "text": "需要等级30，防御0-2，魔御0-1，道术0-1"
  },
  {
      "key": "I1132",
      "name": "绿碎石3",
      "text": "需要等级30，防御0-2，魔御0-2，道术0-1"
  },
  {
      "key": "I1133",
      "name": "绿碎石4",
      "text": "需要等级30，防御0-2，魔御0-2，道术0-2"
  },
  {
      "key": "I1134",
      "name": "绿宝石",
      "text": "需要等级40，防御0-1，魔御0-1，道术0-2"
  },
  {
      "key": "I1135",
      "name": "绿宝石1",
      "text": "需要等级40，防御0-2，魔御0-2，道术0-2"
  },
  {
      "key": "I1136",
      "name": "绿宝石2",
      "text": "需要等级40，防御0-2，魔御0-2，道术0-3"
  },
  {
      "key": "I1137",
      "name": "绿宝石3",
      "text": "需要等级40，防御1-2，魔御1-2，道术0-3"
  },
  {
      "key": "I1138",
      "name": "绿宝石4",
      "text": "需要等级40，防御1-2，魔御1-2，道术1-3"
  },
  // {
  //     "key": "I1139",
  //     "name": "魔血石小",
  //     "text": "装备后生效，每次攻击恢复2生命和3魔力值，有一定时间限制（每获得一次本道具，时间增加，结束后所有本道具清0）。"
  // },
  // {
  //     "key": "I1140",
  //     "name": "魔血石中",
  //     "text": "装备后生效，每次攻击恢复5生命和8魔力值，有一定时间限制（每获得一次本道具，时间增加，结束后所有本道具清0）。"
  // },
  // {
  //     "key": "I1141",
  //     "name": "魔血石",
  //     "text": "装备后生效，每次攻击恢复7生命和12魔力值，有一定时间限制（每获得一次本道具，时间增加，结束后所有本道具清0）。"
  // },
  {
      "key": "I1142",
      "name": "魔血石大",
      "text": "装备后生效，每次攻击恢复10生命和15魔力值，有一定时间限制（每获得一次本道具，时间增加，结束后所有本道具清0）。",
      "count": 99999
  },
  // {
  //     "key": "I1143",
  //     "name": "气血石小",
  //     "text": "装备后生效，每次攻击恢复3生命，有一定时间限制（每获得一次本道具，时间增加，结束后所有本道具清0）。"
  // },
  // {
  //     "key": "I1144",
  //     "name": "气血石中",
  //     "text": "装备后生效，每次攻击恢复7生命，有一定时间限制（每获得一次本道具，时间增加，结束后所有本道具清0）。"
  // },
  // {
  //     "key": "I1145",
  //     "name": "气血石",
  //     "text": "装备后生效，每次攻击恢复10生命，有一定时间限制（每获得一次本道具，时间增加，结束后所有本道具清0）。"
  // },
  {
      "key": "I1146",
      "name": "气血石大",
      "text": "装备后生效，每次攻击恢复15生命，有一定时间限制（每获得一次本道具，时间增加，结束后所有本道具清0）。",
      "count": 99999
  },
  // {
  //     "key": "I1147",
  //     "name": "幻魔石小",
  //     "text": "装备后生效，每次攻击恢复5魔力值，有一定时间限制（每获得一次本道具，时间增加，结束后所有本道具清0）。"
  // },
  // {
  //     "key": "I1148",
  //     "name": "幻魔石中",
  //     "text": "装备后生效，每次攻击恢复12魔力值，有一定时间限制（每获得一次本道具，时间增加，结束后所有本道具清0）。"
  // },
  // {
  //     "key": "I1149",
  //     "name": "幻魔石",
  //     "text": "装备后生效，每次攻击恢复18魔力值，有一定时间限制（每获得一次本道具，时间增加，结束后所有本道具清0）。"
  // },
  {
      "key": "I1150",
      "name": "幻魔石大",
      "text": "装备后生效，每次攻击恢复25魔力值，有一定时间限制（每获得一次本道具，时间增加，结束后所有本道具清0）。",
      "count": 99999
  },
  {
      "key": "I1151",
      "name": "F逆火手镯3",
      "text": "需要等级55，防御0-8，魔御0-8，魔法5-15"
  },
  {
      "key": "I1152",
      "name": "F逆火手镯4",
      "text": "需要等级55，防御0-9，魔御0-9，魔法5-16"
  },
  {
      "key": "I1153",
      "name": "F逆火手镯5",
      "text": "需要等级55，防御0-10，魔御0-10，魔法5-17"
  },
  {
      "key": "I1154",
      "name": "D通云手镯",
      "text": "需要等级55，魔御0-5，道术3-15"
  },
  {
      "key": "I1155",
      "name": "D通云手镯1",
      "text": "需要等级55，魔御0-6，道术3-17"
  },
  {
      "key": "I1156",
      "name": "D通云手镯2",
      "text": "需要等级55，魔御0-7，道术3-19"
  },
  {
      "key": "I1157",
      "name": "D通云手镯3",
      "text": "需要等级55，魔御0-8，道术3-21"
  },
  {
      "key": "I1158",
      "name": "D通云手镯4",
      "text": "需要等级55，魔御0-9，道术3-23"
  },
  {
      "key": "I1159",
      "name": "D通云手镯5",
      "text": "需要等级55，魔御0-10，道术3-25"
  },
  {
      "key": "I1160",
      "name": "Z狂雷戒指",
      "text": "需要等级55，魔御0-5，攻击0-20"
  },
  {
      "key": "I1161",
      "name": "Z狂雷戒指1",
      "text": "需要等级55，魔御0-6，攻击0-22"
  },
  {
      "key": "I1162",
      "name": "Z狂雷戒指2",
      "text": "需要等级55，魔御0-7，攻击0-24"
  },
  {
      "key": "I1163",
      "name": "Z狂雷戒指3",
      "text": "需要等级55，魔御0-8，攻击0-26"
  },
  {
      "key": "I1164",
      "name": "Z狂雷戒指4",
      "text": "需要等级55，魔御0-9，攻击0-28"
  },
  {
      "key": "I1165",
      "name": "Z狂雷戒指5",
      "text": "需要等级55，魔御0-10，攻击0-30"
  },
  {
      "key": "I1166",
      "name": "F逆火魔戒",
      "text": "需要等级55，魔御0-5，魔法0-18"
  },
  {
      "key": "I1167",
      "name": "F逆火魔戒1",
      "text": "需要等级55，魔御0-6，魔法0-19"
  },
  {
      "key": "I1168",
      "name": "F逆火魔戒2",
      "text": "需要等级55，魔御0-7，魔法0-20"
  },
  {
      "key": "I1169",
      "name": "Z开天",
      "text": "需要等级43，攻击8-45"
  },
  {
      "key": "I1170",
      "name": "Z开天1",
      "text": "需要等级43，攻击8-47"
  },
  {
      "key": "I1171",
      "name": "Z开天2",
      "text": "需要等级43，攻击8-49"
  },
  {
      "key": "I1172",
      "name": "Z开天3",
      "text": "需要等级43，攻击8-52"
  },
  {
      "key": "I1173",
      "name": "Z开天7",
      "text": "需要等级43，攻击8-60，真正的次终极武器"
  },
  {
      "key": "I1174",
      "name": "F镇天",
      "text": "需要等级43，魔法5-15"
  },
  {
      "key": "I1175",
      "name": "F镇天1",
      "text": "需要等级43，魔法5-17"
  },
  {
      "key": "I1176",
      "name": "F镇天2",
      "text": "需要等级43，魔法5-19"
  },
  {
      "key": "I1177",
      "name": "F镇天3",
      "text": "需要等级43，魔法5-22"
  },
  {
      "key": "I1178",
      "name": "F镇天7",
      "text": "需要等级43，魔法5-28，真正的次终极武器"
  },
  {
      "key": "I1179",
      "name": "D玄天",
      "text": "需要等级43，道术7-15"
  },
  {
      "key": "I1180",
      "name": "D玄天1",
      "text": "需要等级43，道术7-17"
  },
  {
      "key": "I1181",
      "name": "D玄天2",
      "text": "需要等级43，道术7-19"
  },
  {
      "key": "I1182",
      "name": "D玄天3",
      "text": "需要等级43，道术7-22"
  },
  {
      "key": "I1183",
      "name": "D玄天7",
      "text": "需要等级43，道术7-28，真正的次终极武器"
  },
  {
      "key": "I1184",
      "name": "Z雷霆战甲男",
      "text": "需要等级42，防御5-12，魔御4-8，攻击1-3"
  },
  {
      "key": "I1185",
      "name": "Z雷霆战甲男1",
      "text": "需要等级42，防御5-13，魔御4-9，攻击1-3"
  },
  {
      "key": "I1186",
      "name": "Z雷霆战甲男2",
      "text": "需要等级42，防御5-13，魔御4-9，攻击1-4"
  },
  {
      "key": "I1187",
      "name": "Z雷霆战甲男3",
      "text": "需要等级42，防御5-14，魔御4-10，攻击1-5"
  },
  {
      "key": "I1188",
      "name": "Z雷霆战甲男4",
      "text": "需要等级42，防御5-15，魔御4-11，攻击1-5"
  },
  {
      "key": "I1189",
      "name": "Z雷霆战甲男5",
      "text": "需要等级42，防御5-15，魔御4-11，攻击1-6"
  },
  {
      "key": "I1190",
      "name": "Z雷霆战甲女",
      "text": "需要等级42，防御5-12，魔御4-8，攻击1-3"
  },
  {
      "key": "I1191",
      "name": "Z雷霆战甲女1",
      "text": "需要等级42，防御5-13，魔御4-9，攻击1-3"
  },
  {
      "key": "I1192",
      "name": "Z雷霆战甲女2",
      "text": "需要等级42，防御5-13，魔御4-9，攻击1-4"
  },
  {
      "key": "I1193",
      "name": "Z雷霆战甲女3",
      "text": "需要等级42，防御5-14，魔御4-10，攻击1-5"
  },
  {
      "key": "I1194",
      "name": "Z雷霆战甲女4",
      "text": "需要等级42，防御5-15，魔御4-11，攻击1-5"
  },
  {
      "key": "I1195",
      "name": "Z雷霆战甲女5",
      "text": "需要等级42，防御5-15，魔御4-11，攻击1-6"
  },
  {
      "key": "I1197",
      "name": "F烈焰魔衣男",
      "text": "需要等级42，防御5-12，魔御4-8，魔法3-5"
  },
  {
      "key": "I1198",
      "name": "F烈焰魔衣男1",
      "text": "需要等级42，防御5-13，魔御4-9，魔法3-5"
  },
  {
      "key": "I1199",
      "name": "F烈焰魔衣男2",
      "text": "需要等级42，防御5-13，魔御4-9，魔法3-6"
  },
  {
      "key": "I1200",
      "name": "F烈焰魔衣男3",
      "text": "需要等级42，防御5-14，魔御4-10，魔法3-7"
  },
  {
      "key": "I1201",
      "name": "F烈焰魔衣男4",
      "text": "需要等级42，防御5-15，魔御4-11，魔法3-7"
  },
  {
      "key": "I1202",
      "name": "F烈焰魔衣男5",
      "text": "需要等级42，防御5-15，魔御4-11，魔法3-8"
  },
  {
      "key": "I1203",
      "name": "F烈焰魔衣女",
      "text": "需要等级42，防御5-12，魔御4-8，魔法3-5"
  },
  {
      "key": "I1204",
      "name": "F烈焰魔衣女1",
      "text": "需要等级42，防御5-13，魔御4-9，魔法3-5"
  },
  {
      "key": "I1205",
      "name": "F烈焰魔衣女2",
      "text": "需要等级42，防御5-13，魔御4-9，魔法3-6"
  },
  {
      "key": "I1206",
      "name": "F烈焰魔衣女3",
      "text": "需要等级42，防御5-14，魔御4-10，魔法3-7"
  },
  {
      "key": "I1207",
      "name": "F烈焰魔衣女4",
      "text": "需要等级42，防御5-15，魔御4-11，魔法3-7"
  },
  {
      "key": "I1208",
      "name": "F烈焰魔衣女5",
      "text": "需要等级42，防御5-15，魔御4-11，魔法3-8"
  },
  {
      "key": "I1210",
      "name": "D光芒道袍男",
      "text": "需要等级42，防御5-12，魔御4-8，道术3-5"
  },
  {
      "key": "I1211",
      "name": "D光芒道袍男1",
      "text": "需要等级42，防御5-13，魔御4-9，道术3-5"
  },
  {
      "key": "I1212",
      "name": "D光芒道袍男2",
      "text": "需要等级42，防御5-13，魔御4-9，道术3-6"
  },
  {
      "key": "I1213",
      "name": "D光芒道袍男3",
      "text": "需要等级42，防御5-14，魔御4-10，道术3-7"
  },
  {
      "key": "I1214",
      "name": "D光芒道袍男4",
      "text": "需要等级42，防御5-15，魔御4-11，道术3-7"
  },
  {
      "key": "I1215",
      "name": "D光芒道袍男5",
      "text": "需要等级42，防御5-15，魔御4-11，道术3-8"
  },
  {
      "key": "I1216",
      "name": "D光芒道袍女",
      "text": "需要等级42，防御5-12，魔御4-8，道术3-5"
  },
  {
      "key": "I1217",
      "name": "D光芒道袍女1",
      "text": "需要等级42，防御5-13，魔御4-9，道术3-5"
  },
  {
      "key": "I1218",
      "name": "D光芒道袍女2",
      "text": "需要等级42，防御5-13，魔御4-9，道术3-6"
  },
  {
      "key": "I1219",
      "name": "D光芒道袍女3",
      "text": "需要等级42，防御5-14，魔御4-10，道术3-7"
  },
  {
      "key": "I1220",
      "name": "D光芒道袍女4",
      "text": "需要等级42，防御5-15，魔御4-11，道术3-7"
  },
  {
      "key": "I1221",
      "name": "D光芒道袍女5",
      "text": "需要等级42，防御5-15，魔御4-11，道术3-8"
  },
  {
      "key": "I1222",
      "name": "D通云道链5",
      "text": "需要等级55，道术5-30（具有白色虎齿项链的效果）"
  },
  {
      "key": "I1223",
      "name": "Z狂雷手镯",
      "text": "需要等级55，防御0-5，攻击3-15"
  },
  {
      "key": "I1224",
      "name": "Z狂雷手镯1",
      "text": "需要等级55，防御0-6，攻击3-17"
  },
  {
      "key": "I1225",
      "name": "Z狂雷手镯2",
      "text": "需要等级55，防御0-7，攻击3-19"
  },
  {
      "key": "I1226",
      "name": "Z狂雷手镯3",
      "text": "需要等级55，防御0-8，攻击3-21"
  },
  {
      "key": "I1227",
      "name": "凤天魔甲",
      "text": "需要等级45，防御8-12，魔御8-8，（攻击2-5，魔法3-7，道术3-7）"
  },
  {
      "key": "I1228",
      "name": "凤天魔甲(攻+1)",
      "text": "需要等级45，防御8-13，魔御8-9，（攻击2-6，魔法3-7，道术3-7）"
  },
  {
      "key": "I1229",
      "name": "凤天魔甲(攻+2)",
      "text": "需要等级45，防御8-14，魔御8-10，（攻击2-7，魔法3-7，道术3-7）"
  },
  {
      "key": "I1230",
      "name": "凤天魔甲(攻+3)",
      "text": "需要等级45，防御8-15，魔御8-11，（攻击2-8，魔法3-7，道术3-7）"
  },
  {
      "key": "I1231",
      "name": "凤天魔甲(魔+1)",
      "text": "需要等级45，防御8-13，魔御8-9，（攻击2-5，魔法3-8，道术3-7）"
  },
  {
      "key": "I1232",
      "name": "凤天魔甲(魔+2)",
      "text": "需要等级45，防御8-14，魔御8-10，（攻击2-5，魔法3-9，道术3-7）"
  },
  {
      "key": "I1233",
      "name": "凤天魔甲(魔+3)",
      "text": "需要等级45，防御8-15，魔御8-11，（攻击2-5，魔法3-10，道术3-7）"
  },
  {
      "key": "I1234",
      "name": "凤天魔甲(道+1)",
      "text": "需要等级45，防御8-13，魔御8-9，（攻击2-5，魔法3-7，道术3-8）"
  },
  {
      "key": "I1235",
      "name": "凤天魔甲(道+2)",
      "text": "需要等级45，防御8-14，魔御8-10，（攻击2-5，魔法3-7，道术3-9）"
  },
  {
      "key": "I1236",
      "name": "凤天魔甲(道+3)",
      "text": "需要等级45，防御8-15，魔御8-11，（攻击2-5，魔法3-7，道术3-10）"
  },
  {
      "key": "I1237",
      "name": "Z狂雷手镯4",
      "text": "需要等级55，防御0-9，攻击3-23"
  },
  {
      "key": "I1238",
      "name": "Z狂雷手镯5",
      "text": "需要等级55，防御0-10，攻击3-25"
  },
  {
      "key": "I1239",
      "name": "F逆火手镯",
      "text": "需要等级55，防御0-5，魔御0-5，魔法5-12"
  },
  {
      "key": "I1240",
      "name": "凰天魔衣",
      "text": "需要等级45，防御8-12，魔御8-8，（攻击2-5，魔法3-7，道术3-7）"
  },
  {
      "key": "I1241",
      "name": "凰天魔衣1",
      "text": "需要等级45，防御8-13，魔御8-9，（攻击2-6，魔法3-7，道术3-7）"
  },
  {
      "key": "I1242",
      "name": "凰天魔衣2",
      "text": "需要等级45，防御8-14，魔御8-10，（攻击2-7，魔法3-7，道术3-7）"
  },
  {
      "key": "I1243",
      "name": "凰天魔衣3",
      "text": "需要等级45，防御8-15，魔御8-11，（攻击2-8，魔法3-7，道术3-7）"
  },
  {
      "key": "I1244",
      "name": "凰天魔衣4",
      "text": "需要等级45，防御8-13，魔御8-9，（攻击2-5，魔法3-8，道术3-7）"
  },
  {
      "key": "I1245",
      "name": "凰天魔衣5",
      "text": "需要等级45，防御8-14，魔御8-10，（攻击2-5，魔法3-9，道术3-7）"
  },
  {
      "key": "I1246",
      "name": "凰天魔衣6",
      "text": "需要等级45，防御8-15，魔御8-11，（攻击2-5，魔法3-10，道术3-7）"
  },
  {
      "key": "I1247",
      "name": "凰天魔衣7",
      "text": "需要等级45，防御8-13，魔御8-9，（攻击2-5，魔法3-7，道术3-8）"
  },
  {
      "key": "I1248",
      "name": "凰天魔衣8",
      "text": "需要等级45，防御8-14，魔御8-10，（攻击2-5，魔法3-7，道术3-9）"
  },
  {
      "key": "I1249",
      "name": "凰天魔衣9",
      "text": "需要等级45，防御8-15，魔御8-11，（攻击2-5，魔法3-7，道术3-10）"
  },
  {
      "key": "I1250",
      "name": "F逆火手镯1",
      "text": "需要等级55，防御0-6，魔御0-6，魔法5-13"
  },
  {
      "key": "I1251",
      "name": "Z圣龙盔",
      "text": "需要等级42，防御5-6，魔御2-3，攻击0-2"
  },
  {
      "key": "I1252",
      "name": "Z圣龙盔1",
      "text": "需要等级42，防御5-7，魔御2-4，攻击0-3"
  },
  {
      "key": "I1253",
      "name": "Z圣龙盔2",
      "text": "需要等级42，防御5-8，魔御2-5，攻击0-4"
  },
  {
      "key": "I1254",
      "name": "Z圣龙盔3",
      "text": "需要等级42，防御5-9，魔御2-6，攻击0-5"
  },
  {
      "key": "I1255",
      "name": "F逆火手镯2",
      "text": "需要等级55，防御0-7，魔御0-7，魔法5-14"
  },
  {
      "key": "I1256",
      "name": "F魔龙盔",
      "text": "需要等级42，防御5-6，魔御2-3，魔法0-2"
  },
  {
      "key": "I1257",
      "name": "F魔龙盔1",
      "text": "需要等级42，防御5-7，魔御2-4，魔法0-3"
  },
  {
      "key": "I1258",
      "name": "F魔龙盔2",
      "text": "需要等级42，防御5-8，魔御2-5，魔法0-4"
  },
  {
      "key": "I1259",
      "name": "F魔龙盔3",
      "text": "需要等级42，防御5-9，魔御2-6，魔法0-5"
  },
  {
      "key": "I1261",
      "name": "D天龙盔",
      "text": "需要等级42，防御5-6，魔御2-3，道术0-2"
  },
  {
      "key": "I1262",
      "name": "D天龙盔1",
      "text": "需要等级42，防御5-7，魔御2-4，道术0-3"
  },
  {
      "key": "I1263",
      "name": "D天龙盔2",
      "text": "需要等级42，防御5-8，魔御2-5，道术0-4"
  },
  {
      "key": "I1264",
      "name": "D天龙盔3",
      "text": "需要等级42，防御5-9，魔御2-6，道术0-5"
  },
  {
      "key": "I1266",
      "name": "Z战神头盔",
      "text": "需要等级48，防御5-6，魔御2-3，攻击1-4"
  },
  {
      "key": "I1267",
      "name": "Z战神头盔1",
      "text": "需要等级48，防御5-7，魔御2-4，攻击1-5"
  },
  {
      "key": "I1268",
      "name": "Z战神头盔2",
      "text": "需要等级48，防御5-8，魔御2-5，攻击1-6"
  },
  {
      "key": "I1269",
      "name": "Z战神头盔3",
      "text": "需要等级48，防御5-9，魔御2-6，攻击1-7"
  },
  {
      "key": "I1270",
      "name": "F圣魔头盔",
      "text": "需要等级48，防御5-6，魔御2-3，魔法1-4"
  },
  {
      "key": "I1271",
      "name": "F圣魔头盔1",
      "text": "需要等级48，防御5-7，魔御2-4，魔法1-5"
  },
  {
      "key": "I1272",
      "name": "F圣魔头盔2",
      "text": "需要等级48，防御5-8，魔御2-5，魔法1-6"
  },
  {
      "key": "I1273",
      "name": "F圣魔头盔3",
      "text": "需要等级48，防御5-9，魔御2-6，魔法1-7"
  },
  {
      "key": "I1274",
      "name": "D真魂头盔",
      "text": "需要等级48，防御5-6，魔御2-3，道术1-4"
  },
  {
      "key": "I1275",
      "name": "D真魂头盔1",
      "text": "需要等级48，防御5-7，魔御2-4，道术1-5"
  },
  {
      "key": "I1276",
      "name": "D真魂头盔2",
      "text": "需要等级48，防御5-8，魔御2-5，道术1-6"
  },
  {
      "key": "I1277",
      "name": "D真魂头盔3",
      "text": "需要等级48，防御5-9，魔御2-6，道术1-7"
  },
  {
      "key": "I1279",
      "name": "Z雷霆项链",
      "text": "需要攻击力58，攻击3-7"
  },
  {
      "key": "I1280",
      "name": "Z雷霆项链1",
      "text": "需要攻击力58，攻击3-8"
  },
  {
      "key": "I1281",
      "name": "Z雷霆项链2",
      "text": "需要攻击力58，攻击3-9"
  },
  {
      "key": "I1282",
      "name": "Z雷霆项链3",
      "text": "需要攻击力58，攻击3-10"
  },
  {
      "key": "I1283",
      "name": "F烈焰项链",
      "text": "需要魔法力35，魔法1-9"
  },
  {
      "key": "I1284",
      "name": "F烈焰项链1",
      "text": "需要魔法力35，魔法1-10"
  },
  {
      "key": "I1285",
      "name": "F烈焰项链2",
      "text": "需要魔法力35，魔法1-11"
  },
  {
      "key": "I1286",
      "name": "F烈焰项链3",
      "text": "需要魔法力35，魔法1-12"
  },
  {
      "key": "I1287",
      "name": "D光芒项链",
      "text": "需要精神力42，道术2-8"
  },
  {
      "key": "I1288",
      "name": "D光芒项链1",
      "text": "需要精神力42，道术2-9"
  },
  {
      "key": "I1289",
      "name": "D光芒项链2",
      "text": "需要精神力42，道术2-10"
  },
  {
      "key": "I1290",
      "name": "D光芒项链3",
      "text": "需要精神力42，道术2-11"
  },
  {
      "key": "I1291",
      "name": "Z雷霆护腕",
      "text": "需要攻击力58，防御0-2，魔御0-2，攻击1-4"
  },
  {
      "key": "I1292",
      "name": "Z雷霆护腕1",
      "text": "需要攻击力58，防御0-2，魔御0-2，攻击1-5"
  },
  {
      "key": "I1293",
      "name": "Z雷霆护腕2",
      "text": "需要攻击力58，防御0-3，魔御0-3，攻击1-6"
  },
  {
      "key": "I1294",
      "name": "Z雷霆护腕3",
      "text": "需要攻击力58，防御0-3，魔御0-3，攻击1-7"
  },
  {
      "key": "I1295",
      "name": "F烈焰护腕",
      "text": "需要魔法力37，防御0-2，魔法2-4"
  },
  {
      "key": "I1296",
      "name": "F烈焰护腕1",
      "text": "需要魔法力37，防御0-2，魔法2-5"
  },
  {
      "key": "I1297",
      "name": "F烈焰护腕2",
      "text": "需要魔法力37，防御0-3，魔法2-6"
  },
  {
      "key": "I1298",
      "name": "F烈焰护腕3",
      "text": "需要魔法力37，防御0-3，魔法2-7"
  },
  {
      "key": "I1299",
      "name": "D光芒护腕",
      "text": "需要精神力37，防御1-3，道术2-4"
  },
  {
      "key": "I1300",
      "name": "D光芒护腕1",
      "text": "需要精神力37，防御1-3，道术2-5"
  },
  {
      "key": "I1301",
      "name": "D光芒护腕2",
      "text": "需要精神力37，防御1-4，道术2-6"
  },
  {
      "key": "I1302",
      "name": "D光芒护腕3",
      "text": "需要精神力37，防御1-4，道术2-7"
  },
  {
      "key": "I1303",
      "name": "Z雷霆战戒",
      "text": "需要攻击力58，攻击0-8"
  },
  {
      "key": "I1304",
      "name": "Z雷霆战戒1",
      "text": "需要攻击力58，攻击0-9"
  },
  {
      "key": "I1305",
      "name": "Z雷霆战戒2",
      "text": "需要攻击力58，攻击0-10"
  },
  {
      "key": "I1306",
      "name": "Z雷霆战戒3",
      "text": "需要攻击力58，攻击0-11"
  },
  {
      "key": "I1307",
      "name": "F烈焰魔戒",
      "text": "需要魔法力37，防御0-1，魔法1-7"
  },
  {
      "key": "I1308",
      "name": "F烈焰魔戒1",
      "text": "需要魔法力37，防御0-1，魔法1-8"
  },
  {
      "key": "I1309",
      "name": "F烈焰魔戒2",
      "text": "需要魔法力37，防御0-2，魔法1-9"
  },
  {
      "key": "I1310",
      "name": "F烈焰魔戒3",
      "text": "需要魔法力37，防御0-2，魔法1-10"
  },
  {
      "key": "I1311",
      "name": "D光芒道戒",
      "text": "需要精神力37，防御0-2，道术1-8"
  },
  {
      "key": "I1312",
      "name": "D光芒道戒1",
      "text": "需要精神力37，防御0-2，道术1-9"
  },
  {
      "key": "I1313",
      "name": "D光芒道戒2",
      "text": "需要精神力37，防御0-3，道术1-10"
  },
  {
      "key": "I1314",
      "name": "D光芒道戒3",
      "text": "需要精神力37，防御0-3，道术1-11"
  },
  {
      "key": "I1315",
      "name": "F逆火魔戒3",
      "text": "需要等级55，魔御0-8，魔法0-21"
  },
  {
      "key": "I1316",
      "name": "F逆火魔戒4",
      "text": "需要等级55，魔御0-9，魔法0-22"
  },
  {
      "key": "I1317",
      "name": "F逆火魔戒5",
      "text": "需要等级55，魔御0-10，魔法0-23"
  },
  {
      "key": "I1318",
      "name": "Z战神项链",
      "text": "需要攻击力62，魔御0-1，攻击3-8"
  },
  {
      "key": "I1319",
      "name": "Z战神项链1",
      "text": "需要攻击力62，魔御0-1，攻击3-9"
  },
  {
      "key": "I1320",
      "name": "Z战神项链2",
      "text": "需要攻击力62，魔御0-2，攻击3-10"
  },
  {
      "key": "I1321",
      "name": "Z战神项链3",
      "text": "需要攻击力62，魔御0-2，攻击3-11"
  },
  {
      "key": "I1322",
      "name": "F圣魔项链",
      "text": "需要魔法力40，防御0-3，魔法1-9"
  },
  {
      "key": "I1323",
      "name": "F圣魔项链1",
      "text": "需要魔法力40，防御0-3，魔法1-10"
  },
  {
      "key": "I1324",
      "name": "F圣魔项链2",
      "text": "需要魔法力40，防御0-4，魔法1-11"
  },
  {
      "key": "I1325",
      "name": "F圣魔项链3",
      "text": "需要魔法力40，防御0-4，魔法1-12"
  },
  {
      "key": "I1326",
      "name": "D真魂项链",
      "text": "需要精神力39，防御0-2，道术2-9"
  },
  {
      "key": "I1327",
      "name": "D真魂项链1",
      "text": "需要精神力39，防御0-2，道术2-10"
  },
  {
      "key": "I1328",
      "name": "D真魂项链2",
      "text": "需要精神力39，防御0-3，道术2-11"
  },
  {
      "key": "I1329",
      "name": "D真魂项链3",
      "text": "需要精神力39，防御0-3，道术2-12"
  },
  {
      "key": "I1330",
      "name": "D通云道戒",
      "text": "需要等级55，魔御0-5，道术0-20"
  },
  {
      "key": "I1331",
      "name": "D通云道戒1",
      "text": "需要等级55，魔御0-6，道术0-22"
  },
  {
      "key": "I1332",
      "name": "D通云道戒2",
      "text": "需要等级55，魔御0-7，道术0-24"
  },
  {
      "key": "I1333",
      "name": "Z战神手镯",
      "text": "需要攻击力62，防御0-2，攻击1-5"
  },
  {
      "key": "I1334",
      "name": "Z战神手镯1",
      "text": "需要攻击力62，防御0-2，攻击1-6"
  },
  {
      "key": "I1335",
      "name": "Z战神手镯2",
      "text": "需要攻击力62，防御0-3，攻击1-7"
  },
  {
      "key": "I1336",
      "name": "Z战神手镯3",
      "text": "需要攻击力62，防御0-3，攻击1-8"
  },
  {
      "key": "I1337",
      "name": "F圣魔手镯",
      "text": "需要魔法力40，防御0-2，魔御0-2，魔法1-5"
  },
  {
      "key": "I1338",
      "name": "F圣魔手镯1",
      "text": "需要魔法力40，防御0-2，魔御0-2，魔法1-6"
  },
  {
      "key": "I1339",
      "name": "F圣魔手镯2",
      "text": "需要魔法力40，防御0-3，魔御0-3，魔法1-7"
  },
  {
      "key": "I1340",
      "name": "F圣魔手镯3",
      "text": "需要魔法力40，防御0-3，魔御0-3，魔法1-8"
  },
  {
      "key": "I1341",
      "name": "D真魂手镯",
      "text": "需要精神力39，魔御0-2，道术1-5"
  },
  {
      "key": "I1342",
      "name": "D真魂手镯1",
      "text": "需要精神力39，魔御0-2，道术1-6"
  },
  {
      "key": "I1343",
      "name": "D真魂手镯2",
      "text": "需要精神力39，魔御0-3，道术1-7"
  },
  {
      "key": "I1344",
      "name": "D真魂手镯3",
      "text": "需要精神力39，魔御0-3，道术1-8"
  },
  {
      "key": "I1345",
      "name": "Z战神戒指",
      "text": "需要攻击力62，魔御0-1，攻击0-9"
  },
  {
      "key": "I1346",
      "name": "Z战神戒指1",
      "text": "需要攻击力62，魔御0-1，攻击0-10"
  },
  {
      "key": "I1347",
      "name": "Z战神戒指2",
      "text": "需要攻击力62，魔御0-2，攻击0-11"
  },
  {
      "key": "I1348",
      "name": "Z战神戒指3",
      "text": "需要攻击力62，魔御0-2，攻击0-12"
  },
  {
      "key": "I1349",
      "name": "F圣魔戒指",
      "text": "需要魔法力40，魔御0-1，魔法2-8"
  },
  {
      "key": "I1350",
      "name": "F圣魔戒指1",
      "text": "需要魔法力40，魔御0-1，魔法2-9"
  },
  {
      "key": "I1351",
      "name": "F圣魔戒指2",
      "text": "需要魔法力40，魔御0-2，魔法2-10"
  },
  {
      "key": "I1352",
      "name": "F圣魔戒指3",
      "text": "需要魔法力40，魔御0-2，魔法2-11"
  },
  {
      "key": "I1353",
      "name": "D真魂戒指",
      "text": "需要精神力39，魔御0-1，道术2-9"
  },
  {
      "key": "I1354",
      "name": "D真魂戒指1",
      "text": "需要精神力39，魔御0-1，道术2-10"
  },
  {
      "key": "I1355",
      "name": "D真魂戒指2",
      "text": "需要精神力39，魔御0-2，道术2-11"
  },
  {
      "key": "I1356",
      "name": "D真魂戒指3",
      "text": "需要精神力39，魔御0-2，道术2-12"
  },
  {
      "key": "I1368",
      "name": "D通云道戒3",
      "text": "需要等级55，魔御0-8，道术0-26"
  },
  {
      "key": "I1369",
      "name": "D通云道戒4",
      "text": "需要等级55，魔御0-9，道术0-28"
  },
  // {
  //     "key": "I1370",
  //     "name": "召唤白虎",
  //     "text": "40级方可学习，每次召唤需要消耗400点魔力，等级+道术越高宝宝越强"
  // },
  {
      "key": "I1371",
      "name": "D通云道戒5",
      "text": "需要等级55，魔御0-10，道术0-30"
  },
  // {
  //     "key": "I1372",
  //     "name": "护体神盾",
  //     "text": "55级后方可学习，可以大大的增强自己的防御"
  // },
  // {
  //     "key": "I1375",
  //     "name": "彻地钉",
  //     "text": "(快捷键4)战士42级群攻技能，对大范围内怪物造成伤害，但有概率会被怪物围住强制战斗。"
  // },
  // {
  //     "key": "I1376",
  //     "name": "激光电影",
  //     "text": "(快捷键4)法师群攻技能，对一长排怪物造成伤害。"
  // },
  // {
  //     "key": "I1377",
  //     "name": "流星火雨",
  //     "text": "(快捷键4)法师42级群攻技能，对超大范围内怪物造成大量伤害。"
  // },
  // {
  //     "key": "I1378",
  //     "name": "飙风破",
  //     "text": "(快捷键4)道士42级群攻技能，对大范围内怪物造成伤害，被怪物围住的概率低（模拟道士隐身术）。"
  // },
  // {
  //     "key": "I1390",
  //     "name": "天下第一",
  //     "text": "此道具为天下第一凭证，如果你切换号和转生，那么需要重新领取（密码不变）"
  // },
  {
      "key": "I1392",
      "name": "彩票币",
      "text": "可在各职业内挂-系统活动中每天领取10个，还可以参与竞猜、福利彩票、锁妖塔、土城NPC等地方获取",
      "count": 99999999
  },
  {
      "key": "I1393",
      "name": "彩票大王",
      "text": "特殊称号，可提升属性100生命上限+10攻魔道，如果想销毁此道具，可在彩票币销毁"
  },
  {
      "key": "I1395",
      "name": "彩票迷",
      "text": "特殊称号，可提升属性20生命上限+2攻魔道，如果想销毁此道具，可在彩票币销毁"
  },
  {
      "key": "I1396",
      "name": "彩票老手",
      "text": "特殊称号，可提升属性50生命上限+5攻魔道，如果想销毁此道具，可在彩票币销毁"
  },
  {
      "key": "I1397",
      "name": "彩票小仙",
      "text": "特殊称号，可提升属性80生命上限+8攻魔道，如果想销毁此道具，可在彩票币销毁"
  },
  // {
  //     "key": "I1399",
  //     "name": "沃玛号角",
  //     "text": "传说中有了本道具就可以创建行会（请到盟重土城附近的沙巴克处，可加入行会）"
  // },
  // {
  //     "key": "I1400",
  //     "name": "行会令牌",
  //     "text": "尊贵的象征！每次读档都需要重新激活"
  // },
  {
      "key": "I1406",
      "name": "红药1千个",
      "text": "即可获得1000瓶金创药大瓶",
      "count": 99999
  },
  {
      "key": "I1407",
      "name": "蓝药1千个",
      "text": "使用即可获得1000瓶魔法药大瓶",
      "count": 99999
  },
  {
      "key": "I1408",
      "name": "雪霜1千个",
      "text": "即可获得1000个万年雪霜",
      "count": 99999
  },
  {
      "key": "I1413",
      "name": "青铜称号",
      "text": "请双击激活，攻魔道0-5 防御0-2 生命上限+100（法师魔法减半）\n"
  },
  {
      "key": "I1414",
      "name": "白银称号",
      "text": "请双击激活，攻魔道0-10 防御0-5 生命上限+200（法师魔法减半）"
  },
  {
      "key": "I1415",
      "name": "黄金称号",
      "text": "请双击激活，攻魔道0-20 防御0-10 生命上限+300（法师魔法减半）"
  },
  {
      "key": "I1416",
      "name": "钻石称号",
      "text": "请双击激活，攻魔道0-30 防御0-15 生命上限+400（法师魔法减半）"
  },
  {
      "key": "I1417",
      "name": "王者称号",
      "text": "请双击激活，攻魔道0-40 防御0-20 生命上限+500（法师魔法减半）"
  },
  {
      "key": "I1418",
      "name": "装备爆率",
      "text": "装备爆率为${flags.zhuangbeibaolv}倍（某些特殊怪除外）\n刀刀切割等级为${flags.daodaoqiege}级\n双击可关闭爆率功能（默认是打开状态）"
  },
  {
      "key": "I1419",
      "name": "永久五倍经验",
      "text": "可以和其他涨经验的道具叠加使用（永久的除外）"
  },
  {
      "key": "I1420",
      "name": "永久八倍经验",
      "text": "可以和其他涨经验的道具叠加使用（永久的除外）"
  },
  {
      "key": "I1421",
      "name": "永久10倍经验",
      "text": "可以和其他涨经验的道具叠加使用（永久的除外）"
  },
  {
      "key": "I1422",
      "name": "永久12倍经验",
      "text": "可以和其他涨经验的道具叠加使用（永久的除外）"
  },
  {
      "key": "I1423",
      "name": "永久15倍经验",
      "text": "可以和其他涨经验的道具叠加使用（永久的除外）"
  },
  {
      "key": "I1439",
      "name": "狂风戒指",
      "text": "等级为${flags.kuangfengxiaoguo}级，无需佩戴，所有职业都能享受，模拟原版的攻速效果，改为增加暴击伤害(并不是增加攻速，而是增加暴击，触发条件为：运10且佩戴特殊项链)"
  },
  {
      "key": "I1441",
      "name": "护身戒指",
      "text": "传奇特殊戒指，当你收到伤害时先扣除你的魔法值（本魔塔直接加生命上限来替代）"
  },
  {
      "key": "I1442",
      "name": "复活戒指",
      "text": "传奇特殊戒指，当你死亡时可以复活（每次激活需要取下并关闭装备框，再重新打开装备框并佩戴，有宝宝状态下无法使用复活技能）"
  },
  {
      "key": "I1446",
      "name": "隐身戒指",
      "text": "传奇特殊戒指，可以让你隐身（本魔塔用道士隐身术来替代此功能）（如果要改成传送隐身术可在内挂里设置）"
  },
  {
      "key": "I1448",
      "name": "火焰戒指",
      "text": "传奇特殊戒指，可以让你使用火球术（本魔塔用远程攻击替代火球术）"
  },
  {
      "key": "I1449",
      "name": "麻痹戒指",
      "text": "传奇特殊戒指，战士的攻击可以让怪物麻痹（佩戴后，有概率让怪物对你攻击为1）(佩戴后可能会导致你无法佩戴其他装备)"
  },
  {
      "key": "I1450",
      "name": "防御戒指",
      "text": "传奇特殊戒指，可以让你使用治愈术(取下时，如果要吃药，需要重新设置你的保护)"
  },
  {
      "key": "I1478",
      "name": "Z狂雷腰带",
      "text": "需要等级55，防御2-5，魔御0-5，攻击0-15"
  },
  {
      "key": "I1479",
      "name": "Z狂雷腰带1",
      "text": "需要等级55，防御2-6，魔御0-6，攻击0-17"
  },
  {
      "key": "I1480",
      "name": "Z狂雷腰带2",
      "text": "需要等级55，防御2-7，魔御0-7，攻击0-19"
  },
  {
      "key": "I1481",
      "name": "Z狂雷腰带3",
      "text": "需要等级55，防御2-8，魔御0-8，攻击0-21"
  },
  {
      "key": "I1482",
      "name": "Z狂雷腰带4",
      "text": "需要等级55，防御2-9，魔御0-9，攻击0-23"
  },
  {
      "key": "I1483",
      "name": "Z狂雷腰带5",
      "text": "需要等级55，防御2-10，魔御0-10，攻击0-25"
  },
  {
      "key": "I1484",
      "name": "F逆火法带",
      "text": "需要等级55，防御2-5，魔御0-5，魔法0-15"
  },
  {
      "key": "I1485",
      "name": "F逆火法带1",
      "text": "需要等级55，防御2-6，魔御0-6，魔法0-16"
  },
  {
      "key": "I1486",
      "name": "F逆火法带2",
      "text": "需要等级55，防御2-7，魔御0-7，魔法0-17"
  },
  {
      "key": "I1487",
      "name": "F逆火法带3",
      "text": "需要等级55，防御2-8，魔御0-8，魔法0-18"
  },
  {
      "key": "I1488",
      "name": "F逆火法带4",
      "text": "需要等级55，防御2-9，魔御0-9，魔法0-19"
  },
  {
      "key": "I1489",
      "name": "F逆火法带5",
      "text": "需要等级55，防御2-10，魔御0-10，魔法0-20"
  },
  {
      "key": "I1490",
      "name": "D通云腰带",
      "text": "需要等级55，防御2-5，魔御0-5，道术0-15"
  },
  {
      "key": "I1491",
      "name": "D通云腰带1",
      "text": "需要等级55，防御2-6，魔御0-6，道术0-17"
  },
  {
      "key": "I1492",
      "name": "D通云腰带2",
      "text": "需要等级55，防御2-7，魔御0-7，道术0-19"
  },
  {
      "key": "I1493",
      "name": "D通云腰带3",
      "text": "需要等级55，防御2-8，魔御0-8，道术0-21"
  },
  {
      "key": "I1494",
      "name": "D通云腰带4",
      "text": "需要等级55，防御2-9，魔御0-9，道术0-23"
  },
  {
      "key": "I1495",
      "name": "D通云腰带5",
      "text": "需要等级55，防御2-10，魔御0-10，道术0-25"
  },
  {
      "key": "I1497",
      "name": "Z狂雷战靴",
      "text": "需要等级55，防御5-10，攻击5-10"
  },
  {
      "key": "I1498",
      "name": "Z狂雷战靴1",
      "text": "需要等级55，防御5-11，攻击5-12"
  },
  {
      "key": "I1499",
      "name": "Z狂雷战靴2",
      "text": "需要等级55，防御5-12，攻击5-14"
  },
  {
      "key": "I1500",
      "name": "Z狂雷战靴3",
      "text": "需要等级55，防御5-13，攻击5-16"
  },
  {
      "key": "I1501",
      "name": "Z狂雷战靴4",
      "text": "需要等级55，防御5-14，攻击5-18"
  },
  {
      "key": "I1502",
      "name": "Z狂雷战靴5",
      "text": "需要等级55，防御5-15，攻击5-20"
  },
  {
      "key": "I1503",
      "name": "F逆火魔靴",
      "text": "需要等级55，防御5-10，魔法5-10"
  },
  {
      "key": "I1504",
      "name": "F逆火魔靴1",
      "text": "需要等级55，防御5-11，魔法5-11"
  },
  {
      "key": "I1505",
      "name": "F逆火魔靴2",
      "text": "需要等级55，防御5-12，魔法5-12"
  },
  {
      "key": "I1506",
      "name": "F逆火魔靴3",
      "text": "需要等级55，防御5-13，魔法5-13"
  },
  {
      "key": "I1507",
      "name": "F逆火魔靴4",
      "text": "需要等级55，防御5-14，魔法5-14"
  },
  {
      "key": "I1508",
      "name": "F逆火魔靴5",
      "text": "需要等级55，防御5-15，魔法5-15"
  },
  {
      "key": "I1509",
      "name": "D通云道靴",
      "text": "需要等级55，防御5-10，道术5-10"
  },
  {
      "key": "I1510",
      "name": "D通云道靴1",
      "text": "需要等级55，防御5-11，道术5-12"
  },
  {
      "key": "I1511",
      "name": "D通云道靴2",
      "text": "需要等级55，防御5-12，道术5-14"
  },
  {
      "key": "I1512",
      "name": "D通云道靴3",
      "text": "需要等级55，防御5-13，道术5-16"
  },
  {
      "key": "I1513",
      "name": "D通云道靴4",
      "text": "需要等级55，防御5-14，道术5-18"
  },
  {
      "key": "I1514",
      "name": "D通云道靴5",
      "text": "需要等级55，防御5-15，道术5-20"
  },
  {
      "key": "I1516",
      "name": "Z狂雷战勋",
      "text": "需要等级55，攻击5-10"
  },
  {
      "key": "I1517",
      "name": "Z狂雷战勋1",
      "text": "需要等级55，攻击5-12"
  },
  {
      "key": "I1518",
      "name": "Z狂雷战勋2",
      "text": "需要等级55，攻击5-14"
  },
  {
      "key": "I1519",
      "name": "Z狂雷战勋3",
      "text": "需要等级55，攻击5-16"
  },
  {
      "key": "I1520",
      "name": "Z狂雷战勋4",
      "text": "需要等级55，攻击5-18"
  },
  {
      "key": "I1521",
      "name": "Z狂雷战勋5",
      "text": "需要等级55，攻击5-20"
  },
  {
      "key": "I1522",
      "name": "F逆火法勋",
      "text": "需要等级55，魔法5-10"
  },
  {
      "key": "I1523",
      "name": "F逆火法勋1",
      "text": "需要等级55，魔法5-11"
  },
  {
      "key": "I1524",
      "name": "F逆火法勋2",
      "text": "需要等级55，魔法5-12"
  },
  {
      "key": "I1525",
      "name": "F逆火法勋3",
      "text": "需要等级55，魔法5-13"
  },
  {
      "key": "I1526",
      "name": "F逆火法勋4",
      "text": "需要等级55，魔法5-14"
  },
  {
      "key": "I1527",
      "name": "F逆火法勋5",
      "text": "需要等级55，魔法5-15"
  },
  {
      "key": "I1528",
      "name": "D通云道勋",
      "text": "需要等级55，道术5-10"
  },
  {
      "key": "I1529",
      "name": "D通云道勋1",
      "text": "需要等级55，道术5-12"
  },
  {
      "key": "I1530",
      "name": "D通云道勋2",
      "text": "需要等级55，道术5-14"
  },
  {
      "key": "I1531",
      "name": "D通云道勋3",
      "text": "需要等级55，道术5-16"
  },
  {
      "key": "I1532",
      "name": "D通云道勋4",
      "text": "需要等级55，道术5-18"
  },
  {
      "key": "I1533",
      "name": "D通云道勋5",
      "text": "需要等级55，道术5-20"
  },
  {
      "key": "I1535",
      "name": "Z狂雷宝石",
      "text": "需要等级55，防御0-5，魔御0-5，攻击0-10"
  },
  {
      "key": "I1536",
      "name": "Z狂雷宝石1",
      "text": "需要等级55，防御0-6，魔御0-6，攻击0-12"
  },
  {
      "key": "I1537",
      "name": "Z狂雷宝石2",
      "text": "需要等级55，防御0-7，魔御0-7，攻击0-14"
  },
  {
      "key": "I1538",
      "name": "Z狂雷宝石3",
      "text": "需要等级55，防御0-8，魔御0-8，攻击0-16"
  },
  {
      "key": "I1539",
      "name": "Z狂雷宝石4",
      "text": "需要等级55，防御0-9，魔御0-9，攻击0-18"
  },
  {
      "key": "I1540",
      "name": "Z狂雷宝石5",
      "text": "需要等级55，防御0-10，魔御0-10，攻击0-20"
  },
  {
      "key": "I1541",
      "name": "F逆火宝石",
      "text": "需要等级55，防御0-5，魔御0-5，魔法0-10"
  },
  {
      "key": "I1542",
      "name": "F逆火宝石1",
      "text": "需要等级55，防御0-6，魔御0-6，魔法0-11"
  },
  {
      "key": "I1543",
      "name": "F逆火宝石2",
      "text": "需要等级55，防御0-7，魔御0-7，魔法0-12"
  },
  {
      "key": "I1544",
      "name": "F逆火宝石3",
      "text": "需要等级55，防御0-8，魔御0-8，魔法0-13"
  },
  {
      "key": "I1545",
      "name": "F逆火宝石4",
      "text": "需要等级55，防御0-9，魔御0-9，魔法0-14"
  },
  {
      "key": "I1546",
      "name": "F逆火宝石5",
      "text": "需要等级55，防御0-10，魔御0-10，魔法0-15"
  },
  {
      "key": "I1547",
      "name": "D通云宝石",
      "text": "需要等级55，防御0-5，魔御0-5，道术0-10"
  },
  {
      "key": "I1548",
      "name": "D通云宝石1",
      "text": "需要等级55，防御0-6，魔御0-6，道术0-12"
  },
  {
      "key": "I1549",
      "name": "D通云宝石2",
      "text": "需要等级55，防御0-7，魔御0-7，道术0-14"
  },
  {
      "key": "I1550",
      "name": "D通云宝石3",
      "text": "需要等级55，防御0-8，魔御0-8，道术0-16"
  },
  {
      "key": "I1551",
      "name": "D通云宝石4",
      "text": "需要等级55，防御0-9，魔御0-9，道术0-18"
  },
  {
      "key": "I1552",
      "name": "D通云宝石5",
      "text": "需要等级55，防御0-10，魔御0-10，道术0-20"
  },
  {
      "key": "I1554",
      "name": "Z狂雷战斧",
      "text": "需要等级55，攻击10-65，终极武器"
  },
  {
      "key": "I1555",
      "name": "Z狂雷战斧1",
      "text": "需要等级55，攻击10-68，终极武器"
  },
  {
      "key": "I1556",
      "name": "Z狂雷战斧2",
      "text": "需要等级55，攻击10-71，终极武器"
  },
  {
      "key": "I1557",
      "name": "Z狂雷战斧3",
      "text": "需要等级55，攻击10-74，终极武器"
  },
  {
      "key": "I1558",
      "name": "Z狂雷战斧4",
      "text": "需要等级55，攻击10-77，终极武器"
  },
  {
      "key": "I1559",
      "name": "Z狂雷战斧5",
      "text": "需要等级55，攻击10-80，终极武器"
  },
  {
      "key": "I1560",
      "name": "Z狂雷战斧6",
      "text": "需要等级55，攻击10-83，终极武器"
  },
  {
      "key": "I1561",
      "name": "Z狂雷战斧7",
      "text": "需要等级55，攻击10-90，真正的终极武器"
  },
  {
      "key": "I1562",
      "name": "F逆火魔杖",
      "text": "需要等级55，魔法8-32，终极武器"
  },
  {
      "key": "I1563",
      "name": "F逆火魔杖1",
      "text": "需要等级55，魔法8-34，终极武器"
  },
  {
      "key": "I1564",
      "name": "F逆火魔杖2",
      "text": "需要等级55，魔法8-36，终极武器"
  },
  {
      "key": "I1565",
      "name": "F逆火魔杖3",
      "text": "需要等级55，魔法8-38，终极武器"
  },
  {
      "key": "I1566",
      "name": "F逆火魔杖4",
      "text": "需要等级55，魔法8-40，终极武器"
  },
  {
      "key": "I1567",
      "name": "F逆火魔杖5",
      "text": "需要等级55，魔法8-42，终极武器"
  },
  {
      "key": "I1568",
      "name": "F逆火魔杖6",
      "text": "需要等级55，魔法8-46，终极武器"
  },
  {
      "key": "I1569",
      "name": "F逆火魔杖7",
      "text": "需要等级55，魔法8-50，终极武器"
  },
  {
      "key": "I1570",
      "name": "D通云扇",
      "text": "需要等级55，道术8-35，终极武器"
  },
  {
      "key": "I1571",
      "name": "D通云扇1",
      "text": "需要等级55，道术8-38，终极武器"
  },
  {
      "key": "I1572",
      "name": "D通云扇2",
      "text": "需要等级55，道术8-41，终极武器"
  },
  {
      "key": "I1573",
      "name": "D通云扇3",
      "text": "需要等级55，道术8-44，终极武器"
  },
  {
      "key": "I1574",
      "name": "D通云扇4",
      "text": "需要等级55，道术8-47，终极武器"
  },
  {
      "key": "I1575",
      "name": "D通云扇5",
      "text": "需要等级55，道术8-50，终极武器"
  },
  {
      "key": "I1576",
      "name": "D通云扇6",
      "text": "需要等级55，道术8-53，终极武器"
  },
  {
      "key": "I1577",
      "name": "D通云扇7",
      "text": "需要等级55，道术8-60，终极武器"
  },
  {
      "key": "I1578",
      "name": "F逆火头盔1",
      "text": "需要等级55，防御10-15，魔御5-10，魔法5-10"
  },
]

function filterArray(arr) {
  const maxNumbers = {};
  const excludedNames = ["骰子1","骰子2","骰子3","骰子4","骰子5","骰子6",'青铜称号','白银称号','黄金称号','钻石称号','王者称号',"【全】金戒指","【全】木剑","【全】降妖除魔戒指","金戒指丶全职业","降妖除魔戒指丶全职业","魔法药中瓶包","超级魔法药","凤天魔甲(攻+3)","凤天魔甲(魔+3)","凤天魔甲(道+3)","凰天魔衣9","蓝药1千个","护身戒指","祝福油","超级祝福油","魔血石大","气血石大","幻魔石大","火焰戒指","麻痹戒指",]

  arr.forEach(item => {
    
    // 匹配中英文字符后跟数字的模式
    const match = item.name.match(/^([\u4e00-\u9fa5A-Za-z]+)(\d*)$/);
    if (match) {
      const letterPart = match[1];
      const numberPart = match[2] ? parseInt(match[2], 10) : 0;

      if (!maxNumbers[letterPart] || numberPart > maxNumbers[letterPart]) {
        maxNumbers[letterPart] = numberPart;
      }
    }
  });

  return arr.filter(item => {
    if (excludedNames.includes(item.name)) {
      return true
    }
    if ((item.text?.includes("攻击") || item.text?.includes("魔法"))) {
      return false
    }
    const match = item.name.match(/^([\u4e00-\u9fa5A-Za-z]+)(\d*)$/);
    if (match) {
      const letterPart = match[1];
      const numberPart = match[2] ? parseInt(match[2], 10) : 0;

      return numberPart === maxNumbers[letterPart];
    }
    return true;
  });
}


const filteredItems = filterArray(a);
console.log(filteredItems);

enemys_fcae963b_31c9_42b4_b48c_bb48d09f3f80.greenSlime.afterBattle.unshift(...filteredItems.map(({key, count}) => ({
  "type": "setValue",
  "name": `item:${key}`,
  "operator": "+=",
  "value": count || 1
})))

enemys_fcae963b_31c9_42b4_b48c_bb48d09f3f80.greenSlime.exp = 1000000